[
  {
    "name": "Association of Latino Professionals For America",
    "clubUrl": "https://csus.campusgroups.com/ALPFA/",
    "description": "The specific purpose of this organization are to unite Latino professionals practicing in the United States, to provide professional networking opportunities for such professionals, and to advance their professional education goals. To promote and maintain high professional standards for Latino professionals. To promote mentoring and professional development relationships and opportunities among Latino professionals practicing in the United States. The organization shall not, except to an insubstantial degree, engage in any activities or exercise any powers that are not in furtherance of the specific purposes described above. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 49,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 1
  },
  {
    "name": "'Esak'tima Center",
    "clubUrl": "https://csus.campusgroups.com/esaktima/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 2
  },
  {
    "name": "2D Animation Club",
    "clubUrl": "https://csus.campusgroups.com/2danimationclub/",
    "description": "The purpose of this organization is for students (open to non-students) that would like to learn, collaborate, and create on all things 2D animation",
    "points": 48,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 3
  },
  {
    "name": "A Cappella Club",
    "clubUrl": "https://csus.campusgroups.com/acappellaclub/",
    "description": "The purpose of this organization is to promote and nurture a cappella music of the past and present through our own C-Sus Voices ensemble.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 4
  },
  {
    "name": "Accounting Society",
    "clubUrl": "https://csus.campusgroups.com/accountingsociety/",
    "description": "The purpose of this organization is to provide members: A) a better understanding of the accounting and finance profession and B) a place to network with peers and mentors interested in the accounting and finance fields.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 5
  },
  {
    "name": "Admissions & Outreach",
    "clubUrl": "https://csus.campusgroups.com/Admissions/",
    "description": "Membership Benefits",
    "points": 10,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 6
  },
  {
    "name": "Afghan Students Association",
    "clubUrl": "https://csus.campusgroups.com/asa/",
    "description": "The purpose of this organization is to promote, embrace and celebrate Afghan culture through raising awareness, promoting social events, as well as fundraising. -Help the impoverished communities in Afghanistan through our efforts of raising money, clothing, and school supplies. -Social events to build connections amongst our Afghan students attending CSUS",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 7
  },
  {
    "name": "African American Male Education Network & Development",
    "clubUrl": "https://csus.campusgroups.com/A2MEND/",
    "description": "The purpose of A2MEND Student Charter is to promote the enhancement of enrollment, success, empowerment, leadership, networking, professionalism, and graduation of individuals included but not limited to African American, Latino, and other students at California State University, Sacramento.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 8
  },
  {
    "name": "All Of Us Or None",
    "clubUrl": "https://csus.campusgroups.com/AOUON/",
    "description": "All of Us or None is a grassroots civil and human rights organization dedicated to fighting against discrimination based on arrest and conviction histories. We advocate for the rights and dignity of formerly and currently incarcerated individuals and their families, working to dismantle systemic injustices and promote equitable treatment.",
    "points": 10,
    "categories": [
      "Political/Advocacy"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 9
  },
  {
    "name": "Allied Students for Justice",
    "clubUrl": "https://csus.campusgroups.com/asfj/",
    "description": "Allied Students for Justice (ASFJ) is an inclusive platform designed to empower students and promote social justice at California State University, Sacramento (CSUS). ASFJ's platform aims to inspire, educate, and mobilize individuals towards creating a more equitable and inclusive society. By fostering dialogue, organizing events, and providing resources, ASFJ encourages students to become active advocates for social justice on and off campus.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 10
  },
  {
    "name": "Alpha Chi Omega",
    "clubUrl": "https://csus.campusgroups.com/AXO/",
    "description": "The purpose of Alpha Chi Omega Fraternity (the National Fraternity), as stated in The Heritage of Alpha Chi Omega Fraternity, is to encourage the spirit of true sisterhood, to develop through personal effort a high moral and mental standard, and to advance the appreciation and practice of the fine arts among its members. Alpha Chi Omega is a women's organization dedicated to empowering real, strong women to reach their potential through a lifelong experience of sisterhood, service and leadership development. This is a place where real, strong women find connection, a community of support and opportunities to grow among those who encourage them to chase their passions and value them for who they really are and want to become.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 11
  },
  {
    "name": "Alpha Kappa Alpha Sorority, Incorporated",
    "clubUrl": "https://csus.campusgroups.com/AKA/",
    "description": "The purpose of Alpha Kappa Alpha Sorority, Incorporated is to cultivate and encourage high scholastic and ethical standards, to promote unity and friendship among college women, to study and help alleviate problems concerning girls and women in order to improve their social stature, to maintain a progressive interest in college life, and to be of service to all mankind.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 12
  },
  {
    "name": "alpha Kappa Delta Phi",
    "clubUrl": "https://csus.campusgroups.com/aKDPhi/",
    "description": "MISSION STATEMENT alpha Kappa Delta Phi Sorority, Inc. fosters the making of successful leaders by assisting and challenging our members to reach their maximum potential. We strive to maintain the highest levels of integrity and innovation in the promotion of sisterhood, philanthropy, scholastic excellence, and Asian-Awareness in the community while creating lifelong relationships. VISION STATEMENT alpha Kappa Delta Phi Inc. will be the most respected, premier network of innovative female leaders within the community by encouraging the growth of our members through cultural diversity and the expression of individuality; Empowering our members to become pioneers for philanthropic, cultural, and scholastic programs worldwide; Developing strategic collaborations and partnerships; and Supporting initiatives promoting the sustainability of our organization and its mission.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 13
  },
  {
    "name": "Alpha Phi",
    "clubUrl": "https://csus.campusgroups.com/aphi/",
    "description": "The purpose of this chapter is the promotion of growth in character, of unity of feeling, of sisterly affection and of social communion among its members. And we who are thus united are under a solemn pledge to lend a helping hand to one another.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 14
  },
  {
    "name": "Alpha Phi Omega",
    "clubUrl": "https://csus.campusgroups.com/apoks/",
    "description": "The purpose of Alpha Phi Omega shall be to assemble college students in a National Service Fraternity in the fellowship of principles derived from the Scout Oath and Scout Law of the Boy Scouts of America; to develop Leadership, to promote Friendship, and to provide Service to humanity; and to further the freedom that is our national, educational, and intellectual heritage.",
    "points": null,
    "categories": [
      "Religious/Spiritual",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Law / Pre-Law"
    ],
    "id": 15
  },
  {
    "name": "Alpha Phi Sigma Criminal Justice Honor Society",
    "clubUrl": "https://csus.campusgroups.com/apscj/",
    "description": "The purpose of Alpha Phi Sigma is to recognize and promote academic excellence among students pursuing a baccalaureate or graduate degree in Criminal Justice, or a related field at California State University, Sacramento.",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Criminal Justice"
    ],
    "id": 16
  },
  {
    "name": "Alpha Psi Lambda",
    "clubUrl": "https://csus.campusgroups.com/apsi/",
    "description": "Alpha Psi Lambda was founded in 1985 at the Ohio State University in Columbus, Ohio.Â We areÂ a Co-educational Fraternity geared towards the goals of Latino students on university campuses.Â While we are a Latino interest Fraternity, Alpha Psi Lambda has welcomed people from a broad spectrum of cultures across the globe.Â Alpha Psi Lambda stands as one family united.Â Our strength lies in our ability to focus on our culture while appreciating the diversity of others.Â The Latino culture is very strongly rooted in family and support, which allows Alpha Psi Lambda to provide those same roots to our Fraternity. Alpha Psi Lambda, to its members, is more than just a Fraternity. It creates that true family support, brotherhood and sisterhood, at a time in a student's life when it is most important.Â Our membership prides itself on the values ofÂ Familia, Culture, Academics, Service and Leadership.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 17
  },
  {
    "name": "American Association of Men in Nursing",
    "clubUrl": "https://csus.campusgroups.com/aamn/",
    "description": "The purpose of this organization is to encourage people of all ages to consider nursing as a profession via an increase community outreach, distribution of educational materials, and to demonstrate contributions being made by men in the nursing profession.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Engineering",
      "Health / Medicine / Nursing"
    ],
    "id": 18
  },
  {
    "name": "American Concrete Institute",
    "clubUrl": "https://csus.campusgroups.com/aci/",
    "description": "The purpose of this organization is to provide concrete design knowledge and resources and to bridge the gap between students and industry professionals.",
    "points": 12,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 19
  },
  {
    "name": "American Institute of Architecture Students",
    "clubUrl": "https://csus.campusgroups.com/AIAS/",
    "description": "The aim of this organization is to offer assistance and tools to foster individual growth and help establish connections between AIAS Chapter members and the broader Sacramento Design Community, facilitated by its affiliation with AIAS, Central Valley AIA, and AIA.Â",
    "points": 2,
    "categories": [
      "Arts & Media",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction",
      "Art / Design"
    ],
    "id": 20
  },
  {
    "name": "American Sign Language Club",
    "clubUrl": "https://csus.campusgroups.com/aslclub/",
    "description": "To empower those who are interested in American Sign Language and Deaf Culture by promoting the use of ASL and involvement in the Deaf community through: activism along with awareness of cultural issues and practices within the greater Sacramento area and all ASL users. To provide an environment that encourages students to learn and practice ASL with their peers through meetings and socials.",
    "points": null,
    "categories": [
      "Political/Advocacy",
      "Service/Volunteer",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 21
  },
  {
    "name": "American Society of Civil Engineers",
    "clubUrl": "https://csus.campusgroups.com/asce/",
    "description": "We the members of the Student Chapter of the American Society of Civil Engineers (ASCE) at Sac State will foster desirable relations among the Parent Chapters, Student Chapters, Clubs, Alumni, sponsors, student body members and faculty. Furthermore, to further the knowledge of the standards and ethics of the engineering profession, to ordain and establish this constitution as a living document to aid future Sacramento State ASCE members.",
    "points": 12,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 22
  },
  {
    "name": "American Society of Mechanical Engineers",
    "clubUrl": "https://csus.campusgroups.com/asme/",
    "description": "The purpose of ASME is to promote professional, personal, and academic development of student engineers by providing contact with the industry professionals. Networking and industry interaction will be via facility tours, technology updates, guest speaker events, and participation in industry related events. ASME members will be provided opportunities to interact with fellow engineering students and other student ASME chapters. ASME will promote life-long learning and the development of ethics, civics, and professionalism in all group activities.",
    "points": 86,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 23
  },
  {
    "name": "American Society of Safety Professionals",
    "clubUrl": "https://csus.campusgroups.com/assp/",
    "description": "The purpose of this organization is to promote the advancement of the safety profession and education, to support the professional growth of its members on campus and in the community, to advance the members' professional preparation by supporting initiatives that advance safety and the acquisition of technical knowledge, and to promote greater professional and social cooperation and interaction among students of safety and related fields.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 24
  },
  {
    "name": "Anime & Manga Society",
    "clubUrl": "https://csus.campusgroups.com/anime/",
    "description": "The purpose of this organization is to serve as a place on the Sacramento State campus that fosters relationships among the Sacramento State community and the community at large through mutual interest in Anime and Manga.",
    "points": 130,
    "categories": [
      "Professional",
      "Service/Volunteer",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [],
    "id": 25
  },
  {
    "name": "Aquatic Center",
    "clubUrl": "https://csus.campusgroups.com/aquaticcenter/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 26
  },
  {
    "name": "Arab Student Union",
    "clubUrl": "https://csus.campusgroups.com/ASUCSUS/",
    "description": "A club to bring together the Arab community here at Sacramento State to celebrate and enhance our culture and heritage. All who are passionate about the purpose/mission of the organization are welcomed regardless of identity",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 27
  },
  {
    "name": "Art History Club",
    "clubUrl": "https://csus.campusgroups.com/arthistoryclub/",
    "description": "The purpose of this organization is The Art History Club is looking to create a space for all majors that want to discuss and are passionate about art. We hope to create academic opportunities for club members to grow and apply their knowledge of art history in professional settings. This will be through community activities (gallery and exhibition shows) and collaborative projects across college campuses.",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "History / Philosophy / Religious Studies"
    ],
    "id": 28
  },
  {
    "name": "Arts & Letters Joint Council",
    "clubUrl": "https://csus.campusgroups.com/ALJC/",
    "description": "The purpose of this organization is to provide a collaborative platform for the students and clubs of the college of Arts & Letters and to extend opportunities for shared governance between students, A&L clubs and organizations, A&L administration, faculty, and staff, and Associated Students, Inc..",
    "points": 5,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 29
  },
  {
    "name": "Asian Pacific Islander Desi American (APIDA) Center",
    "clubUrl": "https://csus.campusgroups.com/apidacenter/",
    "description": "Membership Benefits",
    "points": 5,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 30
  },
  {
    "name": "Associated General Contractors",
    "clubUrl": "https://csus.campusgroups.com/agc/",
    "description": "Organization for both experienced and next-generation construction students through the dedicated profession of AGC, educational, career development, networking opportunities, and the creation of opportunities to build and strengthen the workforce by understanding the current and future policies.",
    "points": 20,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction"
    ],
    "id": 31
  },
  {
    "name": "Associated Students Inc.",
    "clubUrl": "https://csus.campusgroups.com/asi/",
    "description": "Membership Benefits",
    "points": 145,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 32
  },
  {
    "name": "Association for Computing Machinery",
    "clubUrl": "https://csus.campusgroups.com/acm/",
    "description": "1. The Chapter is organized and will be operated exclusively for educational and scientific purposes to promote the following:a. An increased knowledge of and greater interest in the science, design, development, construction, languages, management and applications of modern computing.b. A greater interest in computing and its applications.c. A means of communication between persons having an interest in computing.2. The Chapter will serve students at Sac State and other interested persons in the greater Sacramento, CA community.3. The Chapter is chartered by ACM.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction",
      "Art / Design",
      "Media / Journalism / Communications"
    ],
    "id": 33
  },
  {
    "name": "Astronomy Club",
    "clubUrl": "https://csus.campusgroups.com/astronomyclub/",
    "description": "Providing a safe and inclusive place to talk about and practice astronomy, intended for any student who is interested in astronomy.",
    "points": 2,
    "categories": [
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Physics"
    ],
    "id": 34
  },
  {
    "name": "Badminton Club",
    "clubUrl": "https://csus.campusgroups.com/badminton/",
    "description": "The purpose of this organization is to promote and encourage participation in the sport of Badminton.",
    "points": null,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 35
  },
  {
    "name": "Baja Racing SAE",
    "clubUrl": "https://csus.campusgroups.com/BRSAE/",
    "description": "The mission of this organization is to design and build a competitive BAJA SAE buggy and to provide hands on learning of product design, development, and engineering, while encouraging personal growth and fostering a supportive educational and social environment.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Engineering",
      "Environmental / Sustainability"
    ],
    "id": 36
  },
  {
    "name": "Banda",
    "clubUrl": "https://csus.campusgroups.com/Banda/",
    "description": "Banda (Los Sonidos Del Estado) is dedicated to celebrating and preserving the vibrant culture of banda music by fostering a welcoming community for students passionate about its traditions. Through education, performance, and collaboration, we aim to enhance musical skills, promote cultural awareness, and connect with our campus and local communities, inspiring appreciation for the rich heritage of banda.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Music / Performing Arts"
    ],
    "id": 37
  },
  {
    "name": "Baseball Club",
    "clubUrl": "https://csus.campusgroups.com/baseball/",
    "description": "The purpose of this organization is to provide a competitive club baseball team that emphasizes teamwork and sportsmanship. We welcome players of all levels to try out, however there is a limited number of roster spots.",
    "points": 12,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 38
  },
  {
    "name": "Bass Fishing",
    "clubUrl": "https://csus.campusgroups.com/bass/",
    "description": "The purpose of this organization is to facilitate an environment that produces growth in personal and professional development along with community outreach through the avenue of fishing.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 39
  },
  {
    "name": "Bhagat Puran Singh Health Initiative",
    "clubUrl": "https://csus.campusgroups.com/BPSHI/",
    "description": "The purpose of this club shall be to provide basic healthcare screening and general health/nutrition advice to underserved and neglected communities. To fight heart disease and diabetes among at-risk populations and promote general health knowledge to prevent chronic disease. To promote youth advancement among underserved populations. To promote social justice among our members and in the community. To support and connect with other community organizations that serve our target populations.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing"
    ],
    "id": 40
  },
  {
    "name": "Billiards Club",
    "clubUrl": "https://csus.campusgroups.com/DGMC/",
    "description": "The purpose of this organization is to facilitate the enjoyment of billiard games for members of the club. This organization provides billiards as a common platform for members to socialize, participate in friendly competition, and interact with other organizations on and off campus.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [],
    "id": 41
  },
  {
    "name": "Black Business Student Association",
    "clubUrl": "https://csus.campusgroups.com/BBSA/",
    "description": "To provide a support network for Black, African American, and underrepresented students whose common goal is to achieve success in the business world. This includes offering professional development opportunities, networking events, academic support, and community engagement projects to foster growth and inclusion.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 42
  },
  {
    "name": "Black Dance Collective",
    "clubUrl": "https://csus.campusgroups.com/bdc/",
    "description": "Black Dance Collective is dance organization steeped in the rich traditions of Katherine Dunham, Pearl Primus, Alvin Ailey, Geoffrey Holder and other luminaries of the Black Concert Dance aesthetic. Our purpose is to carry those legacies and continue the cultivation of black art at Sacramento State. BDC provides a forum for the exploration of African-derived movement and culture within the context of American modern dance. Our mission is to perform, educate and instruct within various communities: academic, public and private collectively giving back to our society at large.",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Cultural/Identity",
      "Professional",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Music / Performing Arts"
    ],
    "id": 43
  },
  {
    "name": "Black Healthcare Club",
    "clubUrl": "https://csus.campusgroups.com/blackhealthcare/",
    "description": "The purpose of this organization is to encourage, guide, and provide mentorship to future Black health care workers as well as providing exclusive guidance to younger classmen with similar career goals in medicine. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing"
    ],
    "id": 44
  },
  {
    "name": "Black Honors College",
    "clubUrl": "https://csus.campusgroups.com/bhc/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 45
  },
  {
    "name": "Black Student Union",
    "clubUrl": "https://csus.campusgroups.com/bsu/",
    "description": "Purpose: The purpose of this organization is to serve as a resource to unite and uplift the Black community on campus through various events, community engagement, and opportunities for the success of the individual and the student body as a whole. We strive to get our members involved and aware of the social issues and achievements of the Black community.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 46
  },
  {
    "name": "Business Analytics Club",
    "clubUrl": "https://csus.campusgroups.com/businessanalyticsclub/",
    "description": "The purpose of this organization is to explore the data science tools and analytical insight used to sold complex business issues. The academic club is dedicated to exposing members to the skills and opportunities in a high-growth career field.",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting",
      "Data Science"
    ],
    "id": 47
  },
  {
    "name": "Business Honors Society",
    "clubUrl": "https://csus.campusgroups.com/businesshonorssociety/",
    "description": "The purpose of this organization is to provide a single platform for current Business Honors (BHON) Students to collaborate at Sacramento State as well as in the Sacramento business community through participation in networking for business and personal development, as well as serving the community by giving back and volunteering time.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 48
  },
  {
    "name": "Calaveras Station Arts & Literary Journal",
    "clubUrl": "https://csus.campusgroups.com/CSALJ/",
    "description": "The purpose of this organization is to publish a journal of student Art & Literature, edited by a committee of students, each Spring Semester.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Literature / Languages"
    ],
    "id": 49
  },
  {
    "name": "California Geotechnical Engineering Association",
    "clubUrl": "https://csus.campusgroups.com/cgea/",
    "description": "The purpose of the California Geotechnical Engineering Association (CalGeo) Student Chapter at Sac State is to supplement students' academic education with a diverse exposure to geotechnical engineering. As one of only 7 student chapters in California, CalGeo at Sac State offers a unique and personalized opportunity to learn geotechnical engineering and related fields. CalGeo will participate in monthly meetings hosted by both the student chapter and the parent organization feature insightful presentations by professors, principal engineers, licensed geotechnical engineers, and licensed geologists. CalGeo members are supported by all of CalGeo through mentors, scholarships, and networking opportunities. Sac State works closely with ASCE's GeoWall team in funding a competing design at the annual MidPac Conference. CalGeo always welcomes new members to explore the field of geotechnical engineering.",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Education",
      "Engineering"
    ],
    "id": 50
  },
  {
    "name": "California Nursing Students' Association",
    "clubUrl": "https://csus.campusgroups.com/cnsa/",
    "description": "The purpose of the CNSA, Sacramento State Chapter is To assume responsibility for contributing to nursing education in order to provide for the highest quality health care; To provide programs representative of fundamental and current professional interests and concerns; To aid in the development of the whole person, professional role, and responsibility for the health care of people in all walks of life; To have direct input into standards of nursing education and influence the education process; To influence health care, nursing education, and practice through legislative activities as appropriate; To promote and encourage participation in community affairs and activities towards improved health care and the resolution of related issues;  To represent nursing students to the consumer, to institutions, and other organizations; To promote and encourage opportunities for underrepresented students in nursing and CNSA; To promote and encourage students' participation in interdisciplinary activities;  To promote and encourage collaborative relationships with professional nursing organizations and health related organizations; To promote and encourage collaborative relationships with other student organizations; To participate as an active constituent of CNSA and NSNA through dually elected representatives.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Health / Medicine / Nursing"
    ],
    "id": 51
  },
  {
    "name": "Cambodian Students and Alumni Organization",
    "clubUrl": "https://csus.campusgroups.com/CSAO/",
    "description": "The purpose of this organization is to celebrate Cambodia’s rich cultural heritage while building a strong, supportive community for Cambodian students and allies at CSU Sacramento. Through club gatherings, cultural events, alumni connections, and advocacy, we strive to create a welcoming environment that honors our traditions, supports one another, and encourages personal and academic growth. Our mission is to empower students to connect with their roots, build lasting friendships, and contribute to the diverse fabric of the university community.",
    "points": 17,
    "categories": [
      "Academic",
      "Political/Advocacy",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 52
  },
  {
    "name": "Camerata Capistrano",
    "clubUrl": "https://csus.campusgroups.com/cameratacapistrano/",
    "description": "The purpose of this organization is to educate students on the context and performance of baroque era music. This will be done with period style rehearsal and performance of baroque and pre-baroque music.",
    "points": 9,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 53
  },
  {
    "name": "Campus Life",
    "clubUrl": "https://www.csus.edu/student-affairs/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 54
  },
  {
    "name": "Career Center",
    "clubUrl": "https://csus.campusgroups.com/careercenter/",
    "description": "Membership Benefits",
    "points": 400,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 55
  },
  {
    "name": "Caribbean Student Association",
    "clubUrl": "https://csus.campusgroups.com/CSA/",
    "description": "The Caribbean Student Association is dedicated to promoting and uplifting the rich history, vibrant culture, and dynamic community of the Caribbean. Our primary focus is on fostering an inclusive environment that celebrates diversity. Through educational initiatives, cultural events, and community-building activities, we strive to create a supportive and enriching space for Caribbean students and their allies. We are committed to providing opportunities for learning, growth, and connection, ensuring that the voices and stories of the Caribbean are heard and valued on campus.",
    "points": 36,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "History / Philosophy / Religious Studies"
    ],
    "id": 56
  },
  {
    "name": "Ceramics Guild",
    "clubUrl": "https://csus.campusgroups.com/ceramicsguild/",
    "description": "The Ceramics Guild intends to provide a space for students to practice ceramics techniques and to foster relationships among members of the ceramics community at Sacramento State. Upon joining and participating in Ceramics Guild events such as exhibitions, special firings, guest artist demonstrations, and sales, we hope that you will develop a deeper relationship with clay and the greaterÂ Sacramento ceramics community.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 57
  },
  {
    "name": "Chemistry Club",
    "clubUrl": "https://www.csus.edu/indiv/g/ghermanb/chemclub/index.htm",
    "description": "To promote exchange between students studying chemistry and the chemical sciences at California State University, Sacramento. The club also provides outreach to the community through volunteer projects in schools and participates in National Chemistry Week activities each year. The club enables students studying chemistry to connect with one another for tutoring, as well as providing opportunities for professional development.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Chemistry",
      "Engineering"
    ],
    "id": 58
  },
  {
    "name": "Chess Club",
    "clubUrl": "https://csus.campusgroups.com/chess/",
    "description": "This club's purpose is to provide a space for members to improve their Chess skills and learn from other club members.",
    "points": 2,
    "categories": [
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [],
    "id": 59
  },
  {
    "name": "Chi Alpha Christian Fellowship",
    "clubUrl": "https://csus.campusgroups.com/chialpha/",
    "description": "The mission of Chi Alpha shall be to develop the spiritual life and abilities of the students in relation to God, to each other, and to the world at large within a Pentecostal Christian context and in a manner consistent with the teachings of the Assemblies of God USA. As part of this mission, Chi Alpha seeks to introduce fellow collegians to an authentic relationship with Jesus Christ. Chi Alpha plans to do this through:Prayer - Communication with God.Worship - Expressions of thanks through word, music, and serviceFellowship - Community of students developing quality relationships.Discipleship - Learning about Jesus and following His example.Mission - Living a life that reflects our relationship with God in what we say and do.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Religious/Spiritual",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications",
      "Music / Performing Arts"
    ],
    "id": 60
  },
  {
    "name": "Chi Sigma Iota, Chi Sigma Sigma Chapter",
    "clubUrl": "https://csus.campusgroups.com/csi/",
    "description": "CSI is the counseling academic and professional honor society. We provide professional development in counseling.",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 61
  },
  {
    "name": "Chinese Language Club",
    "clubUrl": "https://csus.campusgroups.com/CLC/",
    "description": "The Chinese Language Club is for any student that has interest in learning Mandarin, continue practicing their Mandarin, learning about the contemporary Chinese society, culture and history. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 10,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "History / Philosophy / Religious Studies",
      "Literature / Languages"
    ],
    "id": 62
  },
  {
    "name": "Choral Club",
    "clubUrl": "https://csus.campusgroups.com/choralclub/",
    "description": "As an extension of the existing two choirs (University Chorale and Choral Union) within the CSUS School of Music, this organization’s purpose is to increase the level of participation, engagement, and leadership within choirs through member involvement in the planning and leading of rehearsals and repertoire learning. The club actively engages in community outreach to increase engagement in choir performances and choir membership.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 63
  },
  {
    "name": "Christian Students",
    "clubUrl": "https://csus.campusgroups.com/christianstudents/",
    "description": "The purpose of this organization is to meet students interested in the Bible and to encourage students to pursue Christ by reading the Bible, praying, meeting together, and announcing the gospel.",
    "points": null,
    "categories": [
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 64
  },
  {
    "name": "Circle K International",
    "clubUrl": "https://csus.campusgroups.com/csuscki/",
    "description": "The mission of this club shall be: Circle K International develops college and university students into a global network of responsible citizens and leaders with a lifelong commitment to service.",
    "points": 22,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 65
  },
  {
    "name": "Clarinet Club",
    "clubUrl": "https://csus.campusgroups.com/CCC/",
    "description": "The clarinet club is dedicated to provide a safe community for Sacramento States clarinet enthusiasts of all skill levels. Our mission is to inspire Sac State students playing the clarinet’s creativity, provide necessary supplies and supporting their musical journey",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 66
  },
  {
    "name": "College Assistance Migrant Program",
    "clubUrl": "https://www.csus.edu/student-affairs/centers-programs/college-assistance-migrant-program/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 67
  },
  {
    "name": "College Democrats",
    "clubUrl": "https://csus.campusgroups.com/collegedems/",
    "description": "As the representative organization of the Democratic Party at California StateÂ University, Sacramento, the goal of the College Democrats at Sacramento State isÂ to further the ideas and ideals of the Democratic Party. We vow to uphold theÂ Democratic principles of freedom, social justice, equality, and promote the formation of a society which extends those principles to all, regardless of race, sex, ethnicity, national origin, religion, physical handicap, socioeconomic status, sexual orientation, and gender identity. Furthermore, we seek to increase the involvement of students in the political process by raising awareness of the values and mission of the Democratic Party and by facilitating their direct involvement. It is for this reason and upon these ideals which we establish the College Democrats at Sacramento State.",
    "points": 22,
    "categories": [
      "Political/Advocacy",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 68
  },
  {
    "name": "College of Engineering & Computer Science",
    "clubUrl": "https://www.csus.edu/college/engineering-computer-science/",
    "description": "Membership Benefits",
    "points": 151,
    "categories": [],
    "fieldsOfStudy": [
      "Computer Science",
      "Engineering"
    ],
    "id": 69
  },
  {
    "name": "College Republicans",
    "clubUrl": "https://csus.campusgroups.com/collegerepublicans/",
    "description": "The College Republicans are a community of Conservatives united around the ideas of individual freedom, freedom of speech, a strong national defense, free enterprise, and traditional values.Â The College Republicans are committed to promoting Conservative ideas on campus, advancing and growing the Conservative Movement on our campus and in the local community, promoting Patriotism and American Pride, advocating for Free Speech and for university policies to comply with the First Amendment, fostering intellectual diversity by hosting Conservative speakers, and assisting local candidates with campus exposure.",
    "points": 5,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 70
  },
  {
    "name": "Collegiate 100",
    "clubUrl": "https://csus.campusgroups.com/C100/",
    "description": "The purpose of this organization is to support men and women in providing professional development on and off campus through various of networking opportunities.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 71
  },
  {
    "name": "Combat U - Boxing Club",
    "clubUrl": "https://csus.campusgroups.com/boxing/",
    "description": "Sac State's Combat U Boxing Club Goal is to help members enhance their boxing skills and fitness levels by providing regular practice and tailored instruction. The club's purpose is to promote balanced skill development. It encourages boxers of all backgrounds and skill levels to come together and learn in a friendly environment that fosters a healthy lifestyle using organized training and exercise. The club provides opportunities for competition by hosting internal sparring sessions and participating in external events. Additionally, it emphasizes community engagement",
    "points": 27,
    "categories": [
      "Academic",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 72
  },
  {
    "name": "Combat U - Jiu Jitsu",
    "clubUrl": "https://csus.campusgroups.com/jiujitsu/",
    "description": "The purpose of this organization is to provide a platform for individuals to learn, practice and master the art of Brazilian Jiu- Jitsu in a safe and supportive environment. The club seeks to prepare members for both recreational and competitive opportunities, helping them advance towards their personal and professional goals.",
    "points": 6,
    "categories": [
      "Arts & Media",
      "Professional",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Environmental / Sustainability"
    ],
    "id": 73
  },
  {
    "name": "Combat U - Kickboxing",
    "clubUrl": "https://csus.campusgroups.com/muaythai/",
    "description": "The purpose of this organization is to have participants learn the art of kickboxing while having fun and getting in shape.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 74
  },
  {
    "name": "Combat U - MMA",
    "clubUrl": "https://csus.campusgroups.com/mma/",
    "description": "The purpose of this organization is to cultivate and develop the skills of aspiring Mixed Martial Artists by providing comprehensive training and competitive opportunities. We strive to prepare athletes for higher- level competitions and support their journey toward a professional MMA career in the sport.",
    "points": 6,
    "categories": [
      "Professional",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 75
  },
  {
    "name": "Combat U - Wrestling",
    "clubUrl": "https://csus.campusgroups.com/wrestling/",
    "description": "The purpose of this organization is to provide a platform for individuals to learn, practice and master the art of Wrestling in a safe and supportive environment. The club seeks to prepare members for both recreational and competitive opportunities, helping them advance towards their personal and professional goals.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Environmental / Sustainability"
    ],
    "id": 76
  },
  {
    "name": "Communication Graduate Student Association",
    "clubUrl": "https://csus.campusgroups.com/CGSA/",
    "description": "The Communication Graduate Student Association (CGSA) is an organization by graduate students for graduate students. The purpose of this club is to build community and promote well-being among Communication Studies scholars. CGSA advocates for students’ academic and professional goals. Through student-to-student connection, CGSA serves as a resource library to support members’ success.",
    "points": 60,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 77
  },
  {
    "name": "Community Psychology Club",
    "clubUrl": "https://csus.campusgroups.com/communitypsych/",
    "description": "The purpose of this club is to focus on community-based research in schools around the Sacramento State campus through the Psychology department with graduate and undergraduate students as research assistants.Â",
    "points": null,
    "categories": [
      "Academic",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Psychology"
    ],
    "id": 78
  },
  {
    "name": "Competitive Cheer Club",
    "clubUrl": "https://csus.campusgroups.com/cheer/",
    "description": "The purpose of this organization is to compete competitively at the collegiate level.",
    "points": 5,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 79
  },
  {
    "name": "Competitive Dance Club",
    "clubUrl": "https://csus.campusgroups.com/dance/",
    "description": "The purpose of this organization is to provide unwavering spirit, energy, and enthusiasm while representing the University in areas such as athletic events, rallies, promotional activities, public relations efforts, community service-related projects, and competition. In this role, it is very important that each individual member and the Dance Team collectively make every effort to cooperate in the advancement of the purposes and welfare of the University. It is imperative that each dance member displays the highest possible standards of effort, conduct, competence, and good taste in performance, not only while wearing the uniform, but also in dance membersâ€™ personal lives.",
    "points": 2,
    "categories": [
      "Academic",
      "Arts & Media",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 80
  },
  {
    "name": "Competitive Robotics",
    "clubUrl": "https://csus.campusgroups.com/competitiverobotics/",
    "description": "The purpose of this organization is to promote professional development through team-based engineering project experience and relevant applications of academic material, as well as community and campus involvement.",
    "points": 20,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 81
  },
  {
    "name": "Concrete Canoe Club",
    "clubUrl": "https://csus.campusgroups.com/concretecanoeclub/",
    "description": "The purpose of this organization is to involve students interested in the field of engineering with a year-long project that provides them with hands-on experience applicable to their future engineering careers while competing regionally for a national title. In addition to experiential education, students interact with peers, faculty, and industry professionals to build strong networks and life-long friends.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Education",
      "Engineering"
    ],
    "id": 82
  },
  {
    "name": "Construction Management Association of America Student Chapter",
    "clubUrl": "https://csus.campusgroups.com/CMAA/",
    "description": "To provide students with career and scholarship opportunities in the construction industry through networking and events in association with CMAA",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction"
    ],
    "id": 83
  },
  {
    "name": "Construction Management Student Association",
    "clubUrl": "https://csus.campusgroups.com/CMSA/",
    "description": "The purpose of this organization is to foster the professional development of students for the construction industry through networking opportunities, site visits, presentations and community participation.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction"
    ],
    "id": 84
  },
  {
    "name": "Counselors for Social Justice",
    "clubUrl": "https://csus.campusgroups.com/CSJ/",
    "description": "The Counselors for Social Justice at California State University, Sacramento, is dedicated to acknowledging and combating the systemic oppression affecting our clients, students, faculty, and the wider community. Our mission is driven by equity, justice, and liberation principles, striving to address and reduce disparities through active collaboration with local communities and engagement in the political process. We see advocacy as a term and a core part of our identity as counselors, pushing us to form alliances and tackle barriers at institutional and systemic levels. We aim to empower students interested in social justice with a supportive community, connections, and advocacy opportunities, enhancing their education with additional training beyond the traditional curriculum. This initiative will help shape their identities as social justice advocates and sharpen their advocacy skills. We commit to sharing the latest research in social justice advocacy, facilitating discussions on various advocacy methods, and mobilizing collective actions within our school and community to address social inequities and promote change.",
    "points": null,
    "categories": [
      "Academic",
      "Political/Advocacy",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 85
  },
  {
    "name": "Cricket Club",
    "clubUrl": "https://csus.campusgroups.com/CrC/",
    "description": "The Cricket Club aims to build a welcoming community that introduces the game of cricket to new players while providing a platform for enthusiasts to connect, compete, and grow. We are committed to promoting teamwork, diversity, and school spirit through cricket, fostering both athletic and cultural exchange. By combining passion for the sport with the Hornet pride, our mission is to inspire unity, healthy competition, and lasting friendships on and off the field.",
    "points": null,
    "categories": [
      "Academic",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 86
  },
  {
    "name": "Crochet Club",
    "clubUrl": "https://csus.campusgroups.com/crochet/",
    "description": "Crochet Club teaches fun and engaging crochet workshops that accommodate all skill levels, including beginners and seasoned experts. Crochet Club welcomes all types of people, such as knitters, rug tufters, or anyone interested in yarn & fiber art!",
    "points": 88,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 87
  },
  {
    "name": "Cru",
    "clubUrl": "https://csus.campusgroups.com/cru/",
    "description": "The purpose of the Chapter, as articulated in the Charter, is to build movements of people whoare transformed by Jesus Christ. The student-led movement seeks to introduce students to JesusChrist, help them to grow in their faith, encourage them to live life passionately under thelordship of Christ, and inspire commitment to advancing the purposes of God in the world.",
    "points": null,
    "categories": [
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 88
  },
  {
    "name": "Cyber Security Club",
    "clubUrl": "https://csus.campusgroups.com/cyber/",
    "description": "Explore and practice cyber security topics for both recreation and professional preparation.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Cybersecurity"
    ],
    "id": 89
  },
  {
    "name": "Cycling Club",
    "clubUrl": "https://discord.gg/3VdvJ2z8ju",
    "description": "The purpose of this organization is to spread the joy of riding bicycles and connect others through cycling. It will take its members on various routes within and around the Sacramento area and educate them on the benefits and safety of cycling. Furthermore, it will explore multiple disciplines of cycling, from road to mountain to gravel biking.",
    "points": 14,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 90
  },
  {
    "name": "Dance Alliance",
    "clubUrl": "https://csus.campusgroups.com/dancealliance/",
    "description": "Create an inclusive environment within the Sacramento community through the medium of dance. Promoting dance groups throughout the region to enlighten many of the nature and power of the art form. We will be bringing divided dance worlds together create a safe space and understanding of the world of dance. Specifically, we will host fundraising events that relate to the political climate of our dance world to raise money for the American Dance College Association (ACDA). It is our intention to send a group of dance majors and minors from Sacramento State to ACDA to promote and develop the skills of students for career growth.",
    "points": 24,
    "categories": [
      "Arts & Media",
      "Professional",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Environmental / Sustainability",
      "Music / Performing Arts"
    ],
    "id": 91
  },
  {
    "name": "Data Science Club",
    "clubUrl": "https://csus.campusgroups.com/datascienceclub/",
    "description": "The Data Science Club at Sac State, aims to empower students by offering complimentary workshops and educational resources that equip them with cutting-edge technical skills essential in the data science industry. This initiative is particularly significant due to the absence of an attainable data science degree program at our university.In addition, we host guest speakers from diverse fields and industries who illuminate the pervasive impact of data science on various aspects of life. They also provide insights on how individuals, regardless of their academic background, can embark on their data science journey.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Data Science"
    ],
    "id": 92
  },
  {
    "name": "Data Structures and Algorithms",
    "clubUrl": "https://csus.campusgroups.com/DSA/",
    "description": "The mission of this organization is to provide a forum to exchange ideas and foster discussions for all students interested in the technical pursuit of this core computing concept. In addition, this club will provide technical interview practice, networking opportunities, and growth opportunities for any students interested. The club will foster social interaction for members through hosting events such as programming workshops, group projects, weekly problem discussions, and leetcode contests. It will coordinate events and lectures with the Computer Science Department at Sac State but is open to all students.",
    "points": 8,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 93
  },
  {
    "name": "Delta Epsilon Mu, Nu Chapter",
    "clubUrl": "https://csus.campusgroups.com/dem/",
    "description": "The members of Delta Epsilon Mu, Inc. are committed to serving the community by advocating health education and care, and through active participation in service activities, fundraising, and outreach programs. Members are given the opportunity to directly participate in health-oriented workshops and discussions, thereby attaining access to pertinent academic and career information through association with professors, advisors, career professionals, Alumni Members and fellow Active Members.",
    "points": null,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 94
  },
  {
    "name": "Delta Gamma",
    "clubUrl": "https://csus.campusgroups.com/deegee/",
    "description": "The objects of the Fraternity shall be to foster high ideals of friendship among women, to promote their educational and cultural interests, to create in them a true sense of social responsibility, and to develop in them the best qualities of character.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 95
  },
  {
    "name": "Delta Lambda Phi",
    "clubUrl": "https://csus.campusgroups.com/DLP/",
    "description": "The primary purpose of the chapter is to be a social fraternity. This, however, shall not preclude the chapter or any individual member from participating in events or activities that support the Gay, Lesbian, Bisexual community politically, socially, or otherwise. If the majority of the membership in the quorum deems an activity in which the fraternity as a whole shall participate to be of a political nature, approval must pass with at least a 75% majority.",
    "points": 5,
    "categories": [
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 96
  },
  {
    "name": "Delta Sigma Pi",
    "clubUrl": "https://csus.campusgroups.com/DSP/",
    "description": "To connect students and professionals through the practice of business, helping them realize their full potential in the Epsilon Phi Chapter of Delta Sigma Pi.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 97
  },
  {
    "name": "Design Build Institute of America",
    "clubUrl": "https://csus.campusgroups.com/DBIA/",
    "description": "The purpose of this organization is to promote the value of design-build and integrated project delivery. We aim to provide DBIA accreditation courses and network with professionals to learn the effective integration of design and construction services to ensure success for owners, designers, and construction practitioners. We plan to create long-lasting relationships throughout the industry.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction",
      "Art / Design"
    ],
    "id": 98
  },
  {
    "name": "Disability Justice Club",
    "clubUrl": "https://csus.campusgroups.com/DJC/",
    "description": "The purpose of the Disability Justice Club is present to protect, support, and empower disabled students of California State University, Sacramento as they pursue their academics. DJC is here to support students as they navigate the Disability systems of California State University Sacramento as well as to continue advocating for a more accessible institution. All who are passionate about disability justice are welcomed, disabled or not.",
    "points": 4,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 99
  },
  {
    "name": "Disabled Individuals & Non-Disabled Individuals Organization",
    "clubUrl": "https://csus.campusgroups.com/DINO/",
    "description": "Disabled Individuals & Non-disabled Individuals Organization is an organization that focuses on bringing disabled and non-disabled individuals together in the community to provide advocacy, support, socialization and belonging.",
    "points": 11,
    "categories": [
      "Cultural/Identity",
      "Political/Advocacy",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 100
  },
  {
    "name": "Disciples Reaching and Evangelizing all Mankind Campus Ministry",
    "clubUrl": "https://csus.campusgroups.com/dream/",
    "description": "Welcome to D.R.E.A.M Campus Ministry! Our purpose as a club here on campus is to help students better their relationship with God, learn how to actively read the bible, and give people a family oriented community to grow in.Â",
    "points": 75,
    "categories": [
      "Religious/Spiritual",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 101
  },
  {
    "name": "Diverse Women in Political Science",
    "clubUrl": "https://csus.campusgroups.com/dwips/",
    "description": "We strive to create a respectful and inclusive environment that encourages all students to learn from socio-political discussions, while using healthy communication skills. We aim to be mindful of intersectional identities, committing to anti-racism, and advocating for collective solutions to address issues, including but not limited to those faced by identities of women.",
    "points": null,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "Media / Journalism / Communications",
      "Political Science / Public Policy"
    ],
    "id": 102
  },
  {
    "name": "Doctorate in Educational Leadership Student Association",
    "clubUrl": "https://csus.campusgroups.com/delsa/",
    "description": "The purpose of this organization is to work within the interrelated themes of transformational leadership, critical policy analysis and action, and informed decisions making, to have a significant impact and produce exemplary educational leadership for schools, community colleges, and related educational areas. To provide cohesions, a sense of community, and a network of support that fosters academic, personal, and professional success throughout their doctoral journey and beyond.DELSA will promote scholarship, academic and professional development, networking, and interpersonal communication skills that are essentials to building successfulÂ careers after completion of the program.",
    "points": null,
    "categories": [
      "Academic",
      "Political/Advocacy",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Media / Journalism / Communications",
      "Political Science / Public Policy"
    ],
    "id": 103
  },
  {
    "name": "Dramatist Society",
    "clubUrl": "https://csus.campusgroups.com/dramatistsociety/",
    "description": "The Dramatist Society's purpose is to provide and support the students in the Sac State Theater and Dance departments and those interested in pursuing passions in those fields, and provide a safe and comfortable space for discussion and activities related to Theater related productions and events.",
    "points": 41,
    "categories": [
      "Arts & Media",
      "Professional",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 104
  },
  {
    "name": "Dreamer Resource Center",
    "clubUrl": "https://csus.campusgroups.com/drc/",
    "description": "Membership Benefits",
    "points": 25,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 105
  },
  {
    "name": "East African Students Association",
    "clubUrl": "https://csus.campusgroups.com/EASA/",
    "description": "The East African Students Association at Sacramento State University is dedicated to fostering a vibrant and inclusive community that celebrates the rich cultural heritage of East Africa. Our mission is to create a supportive environment for students of East African descent, promote cultural awareness and appreciation across campus, and provide opportunities for academic, social, and personal growth. Through dynamic events, educational initiatives, and collaborative partnerships, we aim to enhance the cultural diversity of Sacramento State, while empowering our members to thrive academically and professionally.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 106
  },
  {
    "name": "Educational Opportunity Program Student Association",
    "clubUrl": "https://csus.campusgroups.com/eopsa/",
    "description": "The purpose of this organization is to promote retention and engagement in Sac State’s EOP program beyond the first year; develop member’s potential for academic excellence, personal growth, and career success; as well as coordinate activities that bring support to EOP students, students from economically disadvantaged backgrounds, and other underrepresented student groups in the higher education system.",
    "points": 7,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Education"
    ],
    "id": 107
  },
  {
    "name": "Engineering and Computer Science Joint Council",
    "clubUrl": "https://csus.campusgroups.com/ECSJC/",
    "description": "The purpose of this organization is to provide a voice for the students of the College of Engineering and Computer Science (ECS). The ECSJC shall promote the recruitment and retention of the students of the College of ECS, facilitate communication and collaboration between ECS clubs and organizations, and support the College of ECS in its endeavor to better the surrounding community.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Engineering",
      "Media / Journalism / Communications"
    ],
    "id": 108
  },
  {
    "name": "Engineers Without Borders",
    "clubUrl": "https://csus.campusgroups.com/EWB/",
    "description": "The purpose of this organization is to partner with underserved communities at home and internationally to build a more sustainable world. These community-driven partnerships address essential needs with climate conscious infrastructure while cultivating engineering and leadership skills in our partners and chapter volunteers.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Engineering",
      "Environmental / Sustainability"
    ],
    "id": 109
  },
  {
    "name": "English Club",
    "clubUrl": "https://csus.campusgroups.com/englishclub/",
    "description": "The purpose of this organization is to provide a platform for students who are interested in learning and improving their English language skills, as well as to promote cultural exchange and diversity among the members.Â The club also fosters a supportive and friendly environment where students can practice their English communication skills and make new friends. The club organizes various activities, such as open mic poetry and prose reading, book clubs, movie nights, and other events that aim to enhance the linguistic and intercultural competencies of the participants.Â The English Club welcomes students from all majors, levels, and backgrounds who share a common passion for the English language and culture.â€‹",
    "points": 30,
    "categories": [
      "Arts & Media",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "Literature / Languages",
      "Media / Journalism / Communications"
    ],
    "id": 110
  },
  {
    "name": "Ensuring Native Indian Traditions",
    "clubUrl": "https://csus.campusgroups.com/enit/",
    "description": "The purpose of this organization includes the following: To promote higher education for American Indian Students.b.  To promote positive social and cultural activities among Native and non- Native Students.c.  To be a resource for curriculum, financial aid, scholarships, tutoring, support, and other assistance programs both within the ENIT group and throughout the academic as well as the general community.d. To promote skill development and wellness through the participation of trainings, conferences, workshops whether put on by ENIT or put on by outside interest groups. e. Provide lecture series for students on campus that promote completion and the pursuit for higher educationf. To preserve and protect the rights and responsibilities of Native American Traditions.",
    "points": 5,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 111
  },
  {
    "name": "Environmental Student Organization",
    "clubUrl": "https://csus.campusgroups.com/eso/",
    "description": "The purpose of this organization is to educate the Sacramento State University campus on current environmental issues and to spread environmental awareness in the community. We are a nonpartisan group and welcome all members to engage in environmentalism through volunteer work, educational efforts, and activism.",
    "points": 15,
    "categories": [
      "Political/Advocacy",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 112
  },
  {
    "name": "Epsilon Sigma Rho Multicultural Fraternity Inc.",
    "clubUrl": "https://csus.campusgroups.com/rhodawgs/",
    "description": "The mission statement of Epsilon Sigma Rho Multicultural Fraternity Inc. Is to empower men of diverse cultural backgrounds to achieve academic excellence, develop leadership skills, and cultivate a commitment to community service. The fraternity strives to foster brotherhood, cultural awareness, and a sense of social responsibility among its members, while promoting personal growth and academic success.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 113
  },
  {
    "name": "Esports Club",
    "clubUrl": "https://csus.campusgroups.com/esports/",
    "description": "The purpose of this organization is to participate in various competitions across multiple game titles and provide Sacramento State Students the opportunity to develop leadership, communication, and cooperation skills in a competitive or non-competitive environment.",
    "points": 5,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "Esports / Gaming",
      "Media / Journalism / Communications"
    ],
    "id": 114
  },
  {
    "name": "Ethnic Studies Student Association",
    "clubUrl": "https://csus.campusgroups.com/essa/",
    "description": "The Ethnic Studies Student Association is committed to empowering Black, Indigenous, and students of color, and allies through the preservation and teaching of Ethnic Studies. Since the establishment of the first Ethnic Studies Department in 1969, at the San Francisco State University, students have committed to the fight for proper representation in our education. We will continue the struggle to ensure a true and accurate history of our social justice in efforts of liberation for all peoples. The Ethnic Studies Student Association will work alongside California State University of Sacramento students to provide necessary resources to achieve this goal and support our student community",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "History / Philosophy / Religious Studies"
    ],
    "id": 115
  },
  {
    "name": "Field Biology Group",
    "clubUrl": "https://csus.campusgroups.com/fbg/",
    "description": "The purpose of this organization is to provide educational, networking, and career development opportunities for people interested in field biology.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Biology / Life Sciences"
    ],
    "id": 116
  },
  {
    "name": "Financial Planning Association",
    "clubUrl": "https://csus.campusgroups.com/FPA/",
    "description": "The purpose of this organization is to benefit students who are interested in financial planning along with professional development opportunities. Student Chapter club members of the Financial Planning Association (FPA) can expect to build their professional network in the financial planning field and attend free events ranging from guest speakers, professional development, and socials. Other purposes of the Student Chapter are to give students the opportunity to learn about financial planning, have exposure to financial professionals, obtain internships and employment opportunities, and develop interpersonal and leadership skills.",
    "points": 10,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 117
  },
  {
    "name": "First-Gen Biz Bees",
    "clubUrl": "https://csus.campusgroups.com/firstgenbizbees/",
    "description": "The purpose of this organization is to empower first-generation business students on their path to success by providing mentorship, resources, and a supportive community, ensuring equitable access to education and opportunities in the world of business. All students are welcome",
    "points": 22,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting",
      "Education"
    ],
    "id": 118
  },
  {
    "name": "Food and Nutrition Club",
    "clubUrl": "https://csus.campusgroups.com/fan/",
    "description": "The purpose of this organization is to unite Sacramento State students pursuing careers and lifestyles centered on health, wellness, and food. Through professional opportunities and acts of public service, we strive to expand our campus community's understanding of food and its impact on all aspects of life. Our goal is to enrich the experience of membership by helping our fellow students accomplish their career goals, develop confidence in leadership, and educate the campus community.",
    "points": 35,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 119
  },
  {
    "name": "Forensic Engineering Club",
    "clubUrl": "https://csus.campusgroups.com/forensicengineeringclub/",
    "description": "The purpose of this organization is to advance engineering excellence through critical analysis of engineering endeavors where failure has resulted in loss of use, injury or death. We value education, excellence, engagement, innovation, and integrity in engineering.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Education",
      "Engineering"
    ],
    "id": 120
  },
  {
    "name": "Future Business Leaders of America",
    "clubUrl": "https://csus.campusgroups.com/FBLA/",
    "description": "FBLA at Sac State is a business student organization initiated to bring like-minded students together to prepare for their professional future career goals through Networking and Innovative leadership activities.",
    "points": 82,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 121
  },
  {
    "name": "Gamma Phi Beta",
    "clubUrl": "https://csus.campusgroups.com/gammaphi/",
    "description": "The purpose of the standing rules shall be to effect positive student development, on an individual and chapter level while forming the foundation for lifetime commitment to Gamma Phi Beta. Development implies that the growth is to be pursued as a desirable psychological, educational and moral end.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 122
  },
  {
    "name": "Gamma Zeta Alpha",
    "clubUrl": "https://csus.campusgroups.com/gammas/",
    "description": "The specific purposes of this corporation shall be to promote higher education to all people, specifically to the Latino Community which includes, but is not limited to, promoting and educating the community on Latino culture,providing academic support for its members, and engaging in community service projects. The chapters of Gamma Zeta Alpha Fraternity, Inc. are the lifelines of the Fraternity; and therefore, each must function with the utmost effectiveness in performing services for the community and developing both the professional and personal development of its members. We are committed to excellence in training chapters and officers in the fundamental skills necessary to run an effective chapter.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer",
      "Social/Greek",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 123
  },
  {
    "name": "Geo-Challenge",
    "clubUrl": "https://csus.campusgroups.com/geochallenge/",
    "description": "The purpose of this organization is to provide hands-on experience while designing and building a model-sized mechanically stabilized earth retaining wall which will be used in competition at the National American Society of Civil Engineer's Mid-Pacific Conference. Our goal is to work as a team to design the most stable MSE wall using the least amount of materials. The organization hosts events and seminars that facilitate Geo-Challenge's goals and objectives and educate California State University, Sacramento students on theÂ field of Geotechnical Engineering.",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Engineering"
    ],
    "id": 124
  },
  {
    "name": "Geology Club",
    "clubUrl": "https://csus.campusgroups.com/geoclub/",
    "description": "This organization aims to provide a community of like-minded individuals who are interested in the geological sciences and give resources to students in careerÂ and educational advancement in geology.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 125
  },
  {
    "name": "Girl Up",
    "clubUrl": "https://csus.campusgroups.com/girlup/",
    "description": "Girl Up is a club open to all students who are focused on girl-centered leadership development initiatives, focusing on equity for girls and women in spaces where they are unheard or underrepresented. The club is open to everyone regardless of identity!",
    "points": 4,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 126
  },
  {
    "name": "Girls Who Code",
    "clubUrl": "https://csus.campusgroups.com/girlswhocode/",
    "description": "The purpose of this organization, Girls Who Code, is to bridge the gender gap in technology by fostering a love for coding, developing technical skills, building confidence, and promoting inclusivity. Through club activities, workshops, and guest speakers, we provide opportunities for students to explore coding in an engaging manner, gain proficiency in technical concepts, and cultivate self-assurance. Our community emphasizes diversity and offers networking and mentoring opportunities to support members in their educational and career journeys, creating a space where students can learn, grow, and empower each other in the tech industry.",
    "points": 39,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 127
  },
  {
    "name": "Global Medical Brigades",
    "clubUrl": "https://csus.campusgroups.com/GMB/",
    "description": "Global Medical Brigades is a student-led organization that implements a holistic model to achieve the health and economic goals of rural communities in Honduras, Panama, Guatemala, Ghana, Belize, and Greece. In collaboration with other GB Chapters at various universities, our Chapter engages in year-round recruitment and fundraising events, which culminate in our participation in a 7-9 day brigade. During this time, we actively contribute to programming and volunteering efforts, directly impacting the communities we serve.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Computer Science",
      "Economics",
      "Health / Medicine / Nursing"
    ],
    "id": 128
  },
  {
    "name": "Gospel Choir",
    "clubUrl": "https://csus.campusgroups.com/GSPC/",
    "description": "The purpose of this organization is to promote and nurture gospel music in practice and performances through Gospel Choir.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 129
  },
  {
    "name": "Graduate Association of Students in Public Policy and Adminstration",
    "clubUrl": "https://csus.campusgroups.com/gasppa/",
    "description": "The purpose of this organization is to enhance the experience for students in or interested in the Public Policy and Administration (PPA) and Urban Land Development (ULD) programs housed within the Department of Public Policy and Administration (Department) at California State University, Sacramento. Specifically, GASPPA:Supports the Departmentâ€™s PPA and ULD programsProvides educational, professional, and social support for interested and current PPA and ULD studentsPromotes positive relations between students, faculty, alumni, the community, and the University",
    "points": null,
    "categories": [
      "Academic",
      "Political/Advocacy",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Political Science / Public Policy"
    ],
    "id": 130
  },
  {
    "name": "Graduate Public Health Association",
    "clubUrl": "https://csus.campusgroups.com/gpha/",
    "description": "The purpose of this organization is to prepare public health students for graduate focused practice and leadership in the field and provide advice and feedback to the Department of Public Health at California State University, Sacramento. This organization will support students interested in pursuing advanced training and graduate education in public health and provide opportunities to connect with their peers, practicing professionals, and community connections.",
    "points": null,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Health / Medicine / Nursing"
    ],
    "id": 131
  },
  {
    "name": "GRIDS Graphic Design",
    "clubUrl": "https://linktr.ee/grids_sacstate",
    "description": "The purpose of this organization is to provide students the opportunity to supplement, support, and strengthen their design education through networking, events, and shared resources among other design students and industry professionals. We also strive to enhance the graphic design study experience and foster community amongst members.",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Education"
    ],
    "id": 132
  },
  {
    "name": "Guardian Scholars Program",
    "clubUrl": "https://www.csus.edu/student-affairs/centers-programs/guardian-scholars/",
    "description": "The Guardian Scholars Program at Sacramento State is designed to support current and former foster youth students by increasing graduation rates and their overall success. Students who have experienced the foster care system have unique needs and challenges. The GSP program offers various services to support their journey at Sac State. Being a part of the program means more than just a resource; you are part of a family.",
    "points": 2,
    "categories": [],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 133
  },
  {
    "name": "Healthcare Administration Club",
    "clubUrl": "https://csus.campusgroups.com/hca/",
    "description": "The purpose of this organization to provide students the opportunity to learn about the operations of healthcare, learn about the different career paths, expand their network, hear from guest speakers, and become aware of any internships or job opportunities.Â",
    "points": 5,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing"
    ],
    "id": 134
  },
  {
    "name": "HerCampus",
    "clubUrl": "https://csus.campusgroups.com/HerC/",
    "description": "Her Campus is a student organization and online magazine dedicated to empowering, celebrating, and guiding college women. Created by college students for college students, HerCampus serves the campus, giving a fresh and unique experience through localized editorial content, social media channels, events and more!",
    "points": null,
    "categories": [
      "Arts & Media",
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 135
  },
  {
    "name": "Higher Education Leadership Club",
    "clubUrl": "https://csus.campusgroups.com/edlp/",
    "description": "The purpose of this organization is to provide professional development, leadership skills, and networking opportunities to both undergraduate and graduate students who are interested in the higher education field",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 136
  },
  {
    "name": "History Club",
    "clubUrl": "https://csus.campusgroups.com/historyclub/",
    "description": "The purpose of this organization is to facilitate social events centered around students who enjoy learning about history and discussing it. We host and attend group activities such as museum and archive tours, networking events with professionals, and career workshops.",
    "points": 174,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "History / Philosophy / Religious Studies"
    ],
    "id": 137
  },
  {
    "name": "Hmong Bible Study",
    "clubUrl": "https://csus.campusgroups.com/HBS/",
    "description": "To learn the bible and spread the good news of Jesus Christ to college students.",
    "points": 10,
    "categories": [
      "Academic",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 138
  },
  {
    "name": "Hmong University Student Association",
    "clubUrl": "https://csus.campusgroups.com/husa/",
    "description": "The purpose of this organization is to promote higher education to the community, promote Hmong culture, and be a supportive group to the members.",
    "points": 30,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 139
  },
  {
    "name": "Homeless Advocates",
    "clubUrl": "https://csus.campusgroups.com/HASS/",
    "description": "The purpose of this organization is to promote the well-being for all people who are unhoused and disadvantaged, or at the risk of being so, in Sacramento.",
    "points": 5,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 140
  },
  {
    "name": "Honors Program Students",
    "clubUrl": "https://csus.campusgroups.com/hps/",
    "description": "The purpose of this organization is to foster an environment in which our Honors Society can celebrate and embrace program ideals and values such as diversity, global awareness, and lifelong learning. We are to represent the Honors Program to the best of our ability, to create a safe and welcoming environment in which all Honors members are given a fair chance of being heard, and to establish a sense of community among our Honors Society between members, faculty, and the university campus as a whole.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Environmental / Sustainability"
    ],
    "id": 141
  },
  {
    "name": "Hornet Aerospace and Propulsion",
    "clubUrl": "https://csus.campusgroups.com/HAP/",
    "description": "The purpose of this organization is to supplement a student's university coursework with challenging hands-on team projects in aeronautics, astronautics, rocketry, propulsion, and avionics.",
    "points": 5,
    "categories": [
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Aerospace"
    ],
    "id": 142
  },
  {
    "name": "Hornet Communication",
    "clubUrl": "https://csus.campusgroups.com/hornetcommunication/",
    "description": "To provide a space for social and professional development for those interested in Communication Studies.",
    "points": 10,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 143
  },
  {
    "name": "Hornet Cosplay Club",
    "clubUrl": "https://csus.campusgroups.com/Hocco/",
    "description": "To provide a welcoming space for individuals to share and explore various forms of cosplay. The club aims to foster meaningful connections and friendships among members while encouraging creativity and self-expression.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 144
  },
  {
    "name": "Hornet Film Society",
    "clubUrl": "https://csus.campusgroups.com/HFS/",
    "description": "Our mission is to give students hands on experience with filmmaking and give students a creative place to make their own original film projects and network to form connections with future filmmakers.",
    "points": 12,
    "categories": [
      "Arts & Media",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 145
  },
  {
    "name": "Hornet Geography Club",
    "clubUrl": "https://csus.campusgroups.com/HGC/",
    "description": "The purpose of the \"Hornet Geography Club\" is to create a fun and inclusive environment for geography enthusiasts to network and connect.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 146
  },
  {
    "name": "Hornet Racing-Formula SAE",
    "clubUrl": "https://www.hornetracing.net/",
    "description": "Hornet Racing strives to produce the finest and most competitive formula SAE race car in at least one of the seven international Formula SAE competitions every year. In doing so, we help to enrich our members' learning experience beyond what they can obtain in the classroom through extensive hands-on design and manufacturing experience. We make every effort to include any and all students, including non-engineer majors, who are willing to participate, and to provide them with a constructive learning environment that will help to build the program and increases its knowledge base every year. We will accomplish those goals through honest hard work, dedication, teamwork, and effective communication.",
    "points": 5,
    "categories": [
      "Arts & Media",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Computer Science",
      "Environmental / Sustainability",
      "Media / Journalism / Communications"
    ],
    "id": 147
  },
  {
    "name": "Human Resources Management Group",
    "clubUrl": "https://csus.campusgroups.com/HRMG/",
    "description": "The purpose of this organization is to provide CSUS students with a platform where they can network, learn about internship & job opportunities, and explore several human resources topics on professional levels.",
    "points": 5,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 148
  },
  {
    "name": "Improv Club",
    "clubUrl": "https://csus.campusgroups.com/Improv/",
    "description": "Perform Improv exercises and games to explore the use of improv in life and fun.",
    "points": 40,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 149
  },
  {
    "name": "Inclusive Excellence",
    "clubUrl": "https://csus.campusgroups.com/inclusiveexcellence/",
    "description": "Inclusive Excellence at Sacramento State is committed to fostering a campus environment that embraces, empowers, and elevates all Sac State community members. Our mission centers on fostering a campus culture where every student, faculty, staff, and community member feels a profound sense of belonging—being appreciated for their unique contributions, connected to colleagues, supported in daily work and career development, and proud of our institutional values. We strive to create a better serving institution for all. IE operations reach all areas of our campus and bridge us with the broader community through three pillars: Collaborative Servingness: Engaging all areas of campus and the broader community in shared efforts to uplift and serve all. Cultural Insights: Harnessing knowledge and experiences to celebrate cultural richness and create transformative spaces of belonging. Compassionate Compliance: Ensuring compassion and belonging, not just regulatory approaches, are embedded into how we operate and lead.",
    "points": 5,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 150
  },
  {
    "name": "Institute of Transportation Engineers",
    "clubUrl": "https://csus.campusgroups.com/ITE/",
    "description": "The purpose of this organization is to provide a regular way for civil engineering students to learn about transportation engineering and its industry. Gain industry exposure by attending in transportation conferences and ongoing projects. This club is also meant to assist students in professional development.",
    "points": 2,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 151
  },
  {
    "name": "Interfraternity Council",
    "clubUrl": "https://csus.campusgroups.com/IFC/",
    "description": "We, the Interfraternity Council at California State University, Sacramento (Sacramento State) set forth this Constitution and Bylaws in order to cause closer working relationships and coordination among its member chapters and Sacramento State, in accordance with the policies and standards established by the North American Interfraternity Conference (NIC). We, the Interfraternity Council (IFC) exists to advance conditions conducive to the success of its member chapters and to promote the progress of the fraternity experience. With this aim, the IFC actively encourages interfraternalism and collaboration with other fraternity/sorority governing councils and student governance bodies. Maintaining a positive working relationship and partnership with the campus administration, alumni, NIC and inter/national headquarters of member chapters is critical toward elevating the role of the IFC.",
    "points": 15,
    "categories": [
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 152
  },
  {
    "name": "International Interior Design Association",
    "clubUrl": "https://csus.campusgroups.com/IIDA/",
    "description": "The purpose of IIDA is to serve as a professional association nurturing the community, and future advancement of interior designers.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 153
  },
  {
    "name": "International Student Life",
    "clubUrl": "https://csus.campusgroups.com/isl/",
    "description": "The purpose of this organization is to be a valuable resource in helping all international students at California State University Sacramento be successful in school and in their transition into the United States and to have fun.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 154
  },
  {
    "name": "InterVarsity Christian Fellowship",
    "clubUrl": "https://csus.campusgroups.com/ivcf/",
    "description": "In response to God's love, grace and truth: The Purpose of the Chapter is to establish and advance at Sacramento State witnessing communities of students and faculty who follow Jesus as Savior and Lord: growing in love for God, God's Word, God's people of every ethnicity and culture and God's purposes in the world.",
    "points": null,
    "categories": [
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 155
  },
  {
    "name": "Japan Club",
    "clubUrl": "https://csus.campusgroups.com/japanclub/",
    "description": "The purpose of Japan Club is to increase cultural awareness and understanding at California State University of Sacramento and foster a stronger community between Japanese and American Students on campus. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Literature / Languages"
    ],
    "id": 156
  },
  {
    "name": "Jazz Club",
    "clubUrl": "https://csus.campusgroups.com/jazzclub/",
    "description": "The purpose of this organization is to promote the Sacramento State Jazz Studies Degree Program and culture on campus by attending University concerts, guest artist lectures & clinics, and supporting jazz music in the community through outreach concerts and educational seminars.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Music / Performing Arts"
    ],
    "id": 157
  },
  {
    "name": "Jewish Student Union",
    "clubUrl": "https://csus.campusgroups.com/JSU/",
    "description": "The purpose of this organization is to provide space and resources to the culture and activities of Jewish life on campus.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 158
  },
  {
    "name": "Judo Club",
    "clubUrl": "https://csus.campusgroups.com/judo/",
    "description": "The purpose of this organization is to provide a safe and productive environment for judo enthusiast to practice the sport of judo.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 159
  },
  {
    "name": "Kappa Alpha Psi Fraternity, Inc.",
    "clubUrl": "https://csus.campusgroups.com/Nupes/",
    "description": "To encourage honorable achievement in every field of human endeavor. To promote the spiritual, social, intellectual, and moral welfare of its members. To aid the aims and purposes of colleges and universities. To inspire service in the public interest.",
    "points": null,
    "categories": [
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 160
  },
  {
    "name": "Kappa Delta Chi",
    "clubUrl": "https://csus.campusgroups.com/KDChi/",
    "description": "The purpose of this organization is to promote the traditional values of Unity, Honesty, Integrity, and Leadership among women. We are dedicated to providing services to both the University and the community, with a special emphasis on the Hispanic population. We also keep a high standard of achievement in areas of academics. Our sisterhood seeks to open the door to other women andÂ to unite and involve its members through service, academics, and social activities.Â",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 161
  },
  {
    "name": "Kappa Psi Epsilon",
    "clubUrl": "https://csus.campusgroups.com/KPsiE/",
    "description": "To provide leadership in presenting a cohesive course of action to advance the academic, social, scholastic, and professional objectives of the members. To instill the desire for continuous self-improvement. To provide prospective members with common interests and goals, the opportunity to engage in a unique space that emphasizes Pilipin@ and Pilipin@-American culture.",
    "points": 5,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 162
  },
  {
    "name": "Kappa Sigma",
    "clubUrl": "https://csus.campusgroups.com/kappasig/",
    "description": "The purpose of the Nu Lambda Chapter is to advance the ideas and principles of Kappa Sigma, while at all times excelling in all aspects of student life at California State University, Sacramento, particularly in those areas of academics, leadership, community service, and social grace. It is the duty of every member of this chapter to work diligently toward fulfilling this purpose so that we may equal, but none excel.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 163
  },
  {
    "name": "Kin-dom House",
    "clubUrl": "https://csus.campusgroups.com/KindomHouse/",
    "description": "The purpose of Kin-dom House is to engage the community to become supporters for peace with justice work grounded in faith and values through Christianity. We are committed to the challenge of realizing the transformative and liberative aspects of the Christian faith in unity and service of the oppressed, leading the Christian student to a reawakened relevance on campus, and in the church and wider society. It is open to all students of any background. Our Goals are to: • Raise Awareness. • Empower to Organize. • Mobilize for Service. This model is rooted and grounded in Jesus who he himself was a community organizer. Our purpose is to consult with students with their needs, interests and an invitation to be engaged in the Christian faith as an avenue for spirituality through faith and activism.",
    "points": null,
    "categories": [
      "Political/Advocacy",
      "Professional",
      "Religious/Spiritual",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 164
  },
  {
    "name": "Korean Student Association",
    "clubUrl": "https://csus.campusgroups.com/ksa/",
    "description": "To teach non Korean students about Korean culture and to teach Korean students about American culture through events, meetings and activities.Â",
    "points": 12,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Literature / Languages"
    ],
    "id": 165
  },
  {
    "name": "Krescendo K-Pop Dance",
    "clubUrl": "https://csus.campusgroups.com/krescendo/",
    "description": "We are a K-pop dance team and our goals are: a. To produce K-pop dance pieces on social media. b. Spread awareness of K-pop culture through dance showcases, performances, competitions. These goals will be achieved in an inclusive manner regarding K-pop knowledge. We encourage fun and team bonding experience for all members as it must be balanced with focusing on team goals and expectations.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Special Interest / Hobby",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications",
      "Music / Performing Arts"
    ],
    "id": 166
  },
  {
    "name": "Lambda Sigma Gamma",
    "clubUrl": "https://lambdasigmagamma.org/",
    "description": "The purposes of this association are to instill the desire for self-improvement, scholastic excellence and the cultivation of civic responsibility; also to promote unity and higher education amongst women.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Political/Advocacy",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 167
  },
  {
    "name": "Lambda Theta Alpha",
    "clubUrl": "https://csus.campusgroups.com/LTA/",
    "description": "Lambda Theta Alpha Latin Sorority, Inc. Mission Statement: To provide a sisterhood based on Unity, Love and Respect; to provide social and cultural activities, and to carry on charitable and educational programs to promote leadership, maintain high academic standards, and serve as a voice for the Latino community.Â",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 168
  },
  {
    "name": "Lambda Theta Phi",
    "clubUrl": "https://csus.campusgroups.com/lambdas/",
    "description": "The mission of Lambda Theta Phi is to empower the Latin male through scholarship, Brotherhood, opportunity and protection of identity and equality. IDEALS 1. To establish a brotherhood 2. To establish and maintain a high standard of learning 3. To raise the standards of morality and develop character 4. To respect culture and practice chivalry 5. To promote the spirit of mans dignity and self-identity.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 169
  },
  {
    "name": "Lavender Alliance",
    "clubUrl": "https://csus.campusgroups.com/lavalliance/",
    "description": "The purpose of this organization is to promote, improve and advocate for the general welfare and interests of Lesbian, Gay, Bisexual, Transgendered, Queer and Questioning, Intersex, Asexual, Non-Binary, Gender Non-Conforming, herein known as LGBTQIA+, students of California State University Sacramento (CSUS).",
    "points": 7,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 170
  },
  {
    "name": "Management Information Systems Association",
    "clubUrl": "https://csus.campusgroups.com/MISA/",
    "description": "The purpose of this organization is to help our members build a dynamic network in their field of study. We connect CSUS faculty, alumni, and potential employers to our members through a series of events and workshops held over the course of every semester.",
    "points": 29,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 171
  },
  {
    "name": "Marching Band",
    "clubUrl": "https://csus.campusgroups.com/marchingband/",
    "description": "The purpose of this organization is to maintain and support the activities of the Marching Band at California State University, Sacramento and to provide student leadership and engagement to the largest and most spirited organization on campus.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 172
  },
  {
    "name": "Master of Fine Arts",
    "clubUrl": "https://csus.campusgroups.com/masteroffinearts/",
    "description": "The purpose of this organization is to support and enrich the experience of Master of Fine Arts Students during their tenure in the program.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 173
  },
  {
    "name": "Master of Science in Business Analytics Association",
    "clubUrl": "https://csus.campusgroups.com/MSBAA/",
    "description": "The purpose of this organization is to serve Sacramento State's Master of Science in Business Analytics (MSBA) alumni, students, and those interested in the program by helping them connect data and models to substantive business problems for decision making as well as provide spaces and opportunities to network with other data professionals in the field.",
    "points": 6,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting",
      "Computer Science",
      "Data Science"
    ],
    "id": 174
  },
  {
    "name": "Material Advantage Club",
    "clubUrl": "https://csus.campusgroups.com/materialadvantageclub/",
    "description": "The purpose of this club is to study and create works related to and derived from material science applications and mechanical engineering.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 175
  },
  {
    "name": "Math Club",
    "clubUrl": "https://csus.campusgroups.com/mathclub/",
    "description": "The purpose of this organization is to bring together anyone who has an interest in learning about math topics outside of the classroom. Professors, grad students, and even club members present talks and facilitate activities during club meetings.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [
      "Mathematics"
    ],
    "id": 176
  },
  {
    "name": "MEChA",
    "clubUrl": "https://csus.campusgroups.com/MEChA/",
    "description": "A. To carry out the objectives established in El Plan de Santa Barbara, El Plan de Aztlán, and the Philosophy of M.E.Ch.A.; B. To strive for social, educational, cultural, economic, and political empowerment within the Chicana/o Community; C. To encourage Chicana/Chicano student to seek higher education, graduate, and promote Chicanismo within the Chicana/o Community; D. To promote the retention of the Chicano student population on the Sac State Campus; E. To maintain and further the unity and involvement among the Chicana/Chicano students on the Sac State Campus; F. To promote our cultura and historia; G. To retain and advance our Chicana/Chicano identity; H. To maintain contact with the Penutian M.E.Ch.A. Central, the Alta Califas Norte M.E.Ch.A. Región, California Statewide M.E.Ch.A., and National M.E.Ch.A.",
    "points": null,
    "categories": [
      "Academic",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Economics",
      "Education",
      "History / Philosophy / Religious Studies"
    ],
    "id": 177
  },
  {
    "name": "Mechanical Contractors Association of America",
    "clubUrl": "https://csus.campusgroups.com/MCAA/",
    "description": "The purpose of this organization is to introduce and promote mechanical and electrical contracting among students. 1. Promote communication and networking between student members and contractors. 2. Expand the students members's knowledge of the mechanical contracting industry. 3. Unite and promote fellowship between students members and the professional societies that serve the mechanical contracting industry. 4. Familiarize students, faculty and administration with the professional character and economic impact of the mechanical contracting industry.",
    "points": 5,
    "categories": [
      "Professional",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [
      "Economics",
      "Engineering",
      "Media / Journalism / Communications"
    ],
    "id": 178
  },
  {
    "name": "Men's Rugby Club",
    "clubUrl": "https://csus.campusgroups.com/mrugby/",
    "description": "Empowering Excellence, On and Off the Field At Sac State Men's Rugby Club, our vision is to cultivate not just exceptional rugby players, but well-rounded individuals who embody the spirit of teamwork, resilience, and continuous growth. We are committed to fostering a dynamic environment where every player is encouraged to develop both mentally and physically, embracing challenges as opportunities for advancement.We believe in the power of a united team, where each member contributes to a collective goal and takes pride in our shared achievements. Through effective communication, emotional intelligence, and a strong sense of community, we aim to create an atmosphere of mutual respect and understanding.Our focus extends beyond the rugby field. We are dedicated to nurturing leaders who excel in all aspects of life, balancing sportsmanship with academic excellence and personal development. Through mindfulness practices, resilience training, and a commitment to a healthy lifestyle, we equip our athletes with the skills necessary to succeed in any endeavor.In embodying these values, Sac State Menâ€™s Rugby Club strives to be a beacon of excellence, setting a standard for sportsmanship, teamwork, and personal growth. We are more than a team; we are a family, a community, and a legacy in the making.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "Media / Journalism / Communications"
    ],
    "id": 179
  },
  {
    "name": "Men's Soccer Club",
    "clubUrl": "https://csus.campusgroups.com/msoccer/",
    "description": "To compete in high level of competition at the West Coast Soccer Association while establishing a culture involved with respect, commitment, and creating group cohesion. As a member you will be involved with the community, sports clubs, and Sac state.Â",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 180
  },
  {
    "name": "Men's Volleyball Club",
    "clubUrl": "https://csus.campusgroups.com/mvball/",
    "description": "We help young men grow not only as a College student-athletes but as college students. Teaching discipline, responsibility and how to be respectful. To bring out a player's passion for the game of Volleyball by first-hand experiences and passion for the game. To also pass on the traditions of the club, college, and student body. All while enjoying the game of volleyball. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 30,
    "categories": [
      "Cultural/Identity",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 181
  },
  {
    "name": "Minority Association of Pre-Medical Students",
    "clubUrl": "https://csus.campusgroups.com/maps/",
    "description": "The purpose of this organization is to bring an opportunity for pre-health students at Sacramento State to get involved in leadership positions, learn about possible opportunities in the health professions that include medicine, nursing, physician assistants. Minority Association of Pre-Medical Students (MAPS) represent minority undergraduate student at Sacramento State that will bring diversity into health care professions. Our meetings provide opportunities for these students to get involved in volunteer and clinical service in the community. We also provide mentorship and an ability to network with people in the healthcare field. Our purpose is to help our members to achieve their goals and help them grow their grit. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing"
    ],
    "id": 182
  },
  {
    "name": "MLK Center",
    "clubUrl": "https://csus.campusgroups.com/mlk/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 183
  },
  {
    "name": "Model United Nations",
    "clubUrl": "https://csus.campusgroups.com/modelun/",
    "description": "The purpose of this organization is to promote Model United Nations across the campus and support students through personal and professional endeavors.",
    "points": null,
    "categories": [
      "Professional",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [],
    "id": 184
  },
  {
    "name": "Mujeres Ayudando La Raza",
    "clubUrl": "https://csus.campusgroups.com/mar/",
    "description": "We as founding mothers of Mujeres Ayudando La Raza (M.A.R), in accordance with California State University, Sacramento, have established this non-profit organization for the purpose of creating a network of support for Chicanx/Latinx students. Our objective is to promote academic excellence by aiding in the retention of our members in the University. Mujeres Ayudando La Raza is committed to the welfare of Chicanx and Latinx in the community as well as the Chicanx/Latinx population as a whole. Through our community involvement, we strongly encourage awareness of culture and heritage. Simultaneously, we emphasize the diversity that exists within the University and the community. As members, we strive to uphold these goals to the best of our abilities.",
    "points": 15,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 185
  },
  {
    "name": "Multicultural Center",
    "clubUrl": "https://csus.campusgroups.com/mcc/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 186
  },
  {
    "name": "Multicultural Research",
    "clubUrl": "https://csus.campusgroups.com/multiculturalresearch/",
    "description": "The purpose of this Multicultural Research is to conduct research on multicultural topics and issues, including ethnic identity, social interaction, violence, bullying, stereotyping, and prevention and intervention programs.Â Â",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [],
    "id": 187
  },
  {
    "name": "Muslim Student Association",
    "clubUrl": "https://csus.campusgroups.com/msa/",
    "description": "ObjectivesOur mission is to be an inclusive organization on campus--welcoming Muslims and non-Muslims. We strive to educate about Islam, countering misconceptions about the religion, and propagate Islam with utmost clarity. We aim to cultivate an environment where Muslims can come together in a supportive manner and pursue their education, while getting closer to God.We recognize that students are at varying levels in their faith. We are welcoming to all, regardless of the extent of one's religious knowledge or determination.More objectivesÂ Furthermore, the MSA aims to:Increase Islamic Awareness on the CSUS campus.Promote unity and joint action among Muslims.Conduct religious, cultural, and social activities in the best traditions of Islam.Promote friendly relations between Muslims and non-Muslims.Take part in important events in society or be vocal about them. Islam ordained its followers to be just and stand up against injustice, whether in the civic realm or elsewhere.Team up with different entities on and off campus to address specific issues, regardless of whether it directly affects the Muslim population or notÂ  and even if there are idealogical differences with those groups, as this would be an endorsement of the cause and not necessarily the group.Endeavor to make Islamic teachings known to interested non-Muslims.Help Muslim students at CSUS to achieve their educational goals in an Islamic environment during their stay at the university.Encourage active Muslim and Non-Muslim membership.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Political/Advocacy",
      "Professional",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [
      "Education",
      "Environmental / Sustainability"
    ],
    "id": 188
  },
  {
    "name": "National Alliance on Mental Illness (NAMI) on Campus",
    "clubUrl": "https://csus.campusgroups.com/nami/",
    "description": "The purpose of this organization is: -NAMI on Campus clubs are student-led clubs that tackle mental health issues on campus by raising mental health awareness, educating the campus community, supporting students, promoting services and supports and advocating. These clubs are open to all students, whether they live with a mental health condition, are a family member or friend or have an interest in mental health. NAMI on Campus clubs aim to address the mental health needs of all students so they have positive, successful and rewarding college experiences. -NAMI, the National Alliance on Mental Illness, is the nation's largest grassroots mental health organization dedicated to building better lives for the millions of Americans affected by mental illness. NAMI advocates for access to services, treatment, supports and research and is steadfast in its commitment to raising awareness and building a community of hope for all those in need. NAMI California is the NAMI State Organization. This Constitution governs the activities of the organization specific to CSUS. -NAMI on Campus at California State University Sacramento shall endeavor to sponsor and conduct programs and activities that further the purposes and objectives of NAMI, and shall use its best efforts to ensure that such programs and activities are consistent with NAMI's stated values and mission.",
    "points": null,
    "categories": [
      "Academic",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 189
  },
  {
    "name": "National Association for Music Education Collegiate",
    "clubUrl": "https://csus.campusgroups.com/NAMEC/",
    "description": "The purpose of this organization is to provide meaningful professional development opportunities to music educators, and to advocate for equitable access to music education within the Sacramento region and overall educational community.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Music / Performing Arts"
    ],
    "id": 190
  },
  {
    "name": "National Pan-Hellenic Council",
    "clubUrl": "https://csus.campusgroups.com/NPHC/",
    "description": "To create and maintain high standards in the life and ideas of fraternities and sororities. To perpetuate constructive fraternity and sorority relationships. To foster an understanding of the structure and method of operation among the affiliate organizations. To provide leadership training for its constituents.",
    "points": 35,
    "categories": [
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 191
  },
  {
    "name": "National Society of Black Engineers",
    "clubUrl": "https://csus.campusgroups.com/NSBE/",
    "description": "The mission of the National Society of Black Engineers is to Increase the number of culturally responsible black engineers who succeed professionally and positively impact the community. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 192
  },
  {
    "name": "National Society of Leadership and Success",
    "clubUrl": "https://csus.campusgroups.com/nsls/",
    "description": "The organization has been established to create a support group that will help college students achieve their goals and better their lives, in the process building leaders who make a better world. Created for the purpose of assisting college students in creating the lives they desire, by helping students discover their passion and purpose through giving them the support and tools to achieve their goals, in order to build leaders who make a better world.",
    "points": 14,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 193
  },
  {
    "name": "National Student Speech Language Hearing Association",
    "clubUrl": "https://csus.campusgroups.com/nsslha/",
    "description": "The National Student Speech Language and Hearing Association (NSSLHA) Chapter at California State University, Sacramento, is a pre-professional organization open to undergraduate, post-bachelor, and graduate students in the field of, or with an interest in, Communication Sciences and Disorders. NSSLHA members at Sac State are involved in social activities, educational seminars, and fundraising events within our community. We support our local on-campus Speech clinic and the NSSLHA Loves Campaign with a portion of our proceeds. We hold an annual conference attended by students and professionals seeking to expand their knowledge in Speech-Language Pathology and Audiology.",
    "points": 2,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 194
  },
  {
    "name": "Natural Sciences & Mathematics Research Club",
    "clubUrl": "https://csus.campusgroups.com/researchclub/",
    "description": "The purpose of the Natural Sciences & Mathematics Research Club is to promote and facilitate research opportunities for students across all disciplines, particularly in the natural sciences. Research experience is vital for students pursuing post-grad studies, including medical school and dental schools, as well as various scientific careers.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing",
      "Mathematics"
    ],
    "id": 195
  },
  {
    "name": "Newman Catholic Club",
    "clubUrl": "https://csus.campusgroups.com/newman/",
    "description": "Â The purpose of this organization is to encourage young adult college students to seek a deeper relationship with Jesus Christ and to embrace an active, adult faith through formation grounded in the Catholic tradition.",
    "points": null,
    "categories": [
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 196
  },
  {
    "name": "Nigerian Student Association",
    "clubUrl": "https://csus.campusgroups.com/nsa/",
    "description": "The purpose of this organization is the Nigerian Student Association at Sac State is a club that wishes the development of cultural unity amongst the Nigerian community at Sac State. Keep in mind YOU DO NOT HAVE TO BE NIGERIAN TO JOIN; Join this club to engage in exciting activities, experience the amazing culture of. Nigeria, and network with other NSA clubs across the nation. It will be an experience you don't want to miss out on!",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 197
  },
  {
    "name": "Nu Alpha Kappa",
    "clubUrl": "https://csus.campusgroups.com/NAK/",
    "description": "We, NU ALPHA KAPPA Fraternity, Inc. seek to unite and involve all students in a more harmonious and brotherly atmosphere through academic, social and cultural means. There is a need to interface the various backgrounds that constitute the student body of Sacramento County and surrounding areas. Nu Alpha Kappa is a Latino based fraternity, which encompasses and values all cultures.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 198
  },
  {
    "name": "Office of Graduate Studies",
    "clubUrl": "https://csus.campusgroups.com/GradStudies/",
    "description": "Membership Benefits",
    "points": 15,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [],
    "id": 199
  },
  {
    "name": "Office of the President",
    "clubUrl": "https://csus.campusgroups.com/president/",
    "description": "Membership Benefits",
    "points": 30,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 200
  },
  {
    "name": "Orientation Club",
    "clubUrl": "https://csus.campusgroups.com/orientation/",
    "description": "The purpose of this organization is to mirror the standards of New Student Orientation by serving as campus leaders, advocates and resources to new students. We wish to outline and support the University's academic requirements as well as social/developmental opportunities.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [],
    "id": 201
  },
  {
    "name": "Pacific Islanders United",
    "clubUrl": "https://csus.campusgroups.com/piu/",
    "description": "We are a student organization that focuses its agenda on Pacific Islander culture by educating the campus community and surroundings about the different beautiful cultures and traditions within the Pacific Islander community. Our goal is to provide a space on campus for students to create community with one another while helping them preserve, embrace and become aware of their cultural identities. We are here to provide resources and community for our Pacific Islander students so that they have the necessary tools to succeed in Academia.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 202
  },
  {
    "name": "Pakistani Student Association",
    "clubUrl": "https://csus.campusgroups.com/pakistani/",
    "description": "To familiarize Pakistani students with Sacramento State while introducing the campus to the Pakistani culture and building a community on campus.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 203
  },
  {
    "name": "Panhellenic Sorority Council",
    "clubUrl": "https://csus.campusgroups.com/PSC/",
    "description": "The object of the PSC shall be to develop and maintain womens fraternity life and interfraternity relations at a high level of accomplishment and in so doing to: Consider the goals and ideals of member groups as continually applicable to Campus and personal life. Promote superior scholarship and basic intellectual development. Cooperate with member womens fraternities and the university/college administration in concern for and maintenance of high social and moral standards. Act in accordance with National Panhellenic Council (NPC) Unanimous Agreements, policies and best practices. Act in accordance with such rules established by the PSC as to not violate the sovereignty, rights, and privileges of member womens fraternities. Promote the opportunity for diversity among womens fraternities at California State University, Sacramento, further referred to in this document as Sac State.",
    "points": 45,
    "categories": [
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 204
  },
  {
    "name": "Peak Adventures",
    "clubUrl": "https://www.peakadventures.org/",
    "description": "Membership Benefits",
    "points": 490,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 205
  },
  {
    "name": "Phi Alpha Delta (Law Fraternity International)",
    "clubUrl": "https://csus.campusgroups.com/pad/",
    "description": "The purpose of this organization is to form a strong bond uniting students and teachers of the law with members of the Bench and Bar in a fraternal fellowship designed to advance the ideals of liberty and equal justice under law; to stimulate excellence in scholarship; to inspire the virtues of compassion and courage; to foster integrity and professional competence; to promote the welfare of its members; and to encourage their moral, intellectual, and cultural advancement; so that each member may enjoy a lifetime of honorable professional and public service.",
    "points": 5,
    "categories": [
      "Professional",
      "Religious/Spiritual",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Law / Pre-Law"
    ],
    "id": 206
  },
  {
    "name": "Phi Alpha Theta History Honor Society, Rho-Xi Chapter",
    "clubUrl": "https://csus.campusgroups.com/phialphatheta/",
    "description": "The purpose of this organization is to encourage the study of history and recognize excellence in history. Facilitate student transitions into the workforce, and generate a sense of department community through organizing events and encouraging college and lifelong learning and teaching.",
    "points": 10,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "History / Philosophy / Religious Studies"
    ],
    "id": 207
  },
  {
    "name": "Phi Beta Sigma",
    "clubUrl": "https://csus.campusgroups.com/sigmas1914/",
    "description": "The purpose of this organization is its dedication to strong bonds of brotherhood, living with integrity, serving humanity, promoting quality education and developing leaders.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 208
  },
  {
    "name": "Phi Mu",
    "clubUrl": "https://csus.campusgroups.com/phimu/",
    "description": "The purpose of the Eta Rho Chapter shall be to encourage and promote the purpose and ideals of Phi Mu Fraternity to this campus, and to function by the rules in the Fraternityâ€™s Constitution and Bylaws and Standing Rules and Procedures. Our mission statement is: Founded in 1852, Phi Mu is a women's organization which provides personal and academic development, service to others, commitment to excellence and lifelong friendship through a shared tradition. Phi Mu promotes vibrant living, encouraging members to achieve their personal best.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 209
  },
  {
    "name": "Phi Sigma Sigma",
    "clubUrl": "https://csus.campusgroups.com/phisig/",
    "description": "The purpose of this chapter shall be to promote friendship and cooperation amongcollegiate women of all races, creeds, and religions, to raise the standard of academic ideals, andto promote philanthropic endeavors.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 210
  },
  {
    "name": "Photography Club",
    "clubUrl": "https://csus.campusgroups.com/SPC/",
    "description": "The mission of a photography club is to foster a vibrant community of enthusiasts who share a passion for capturing and celebrating the world through the lens. The club aims to provide a supportive environment where members, regardless of skill level, can learn, grow, and express their artistic visions. By organizing workshops, critiques, and guest lectures, the club encourages skill development and creative exploration. Additionally, the club seeks to promote collaboration and networking among photographers, allowing members to share knowledge, techniques, and experiences. Through group outings and themed challenges, participants can hone their skills in diverse settings while discovering new perspectives and styles. Ultimately, the mission of the photography club is to inspire creativity, build lasting friendships, and cultivate a deeper understanding of the power of visual storytelling, all while celebrating the beauty of our shared world.",
    "points": 39,
    "categories": [
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "Media / Journalism / Communications"
    ],
    "id": 211
  },
  {
    "name": "Pi Kappa Phi",
    "clubUrl": "https://csus.campusgroups.com/pikapp/",
    "description": "The name of this subordinate chapter shall be the Epsilon Nu Associate Chapter of Pi Kappa Phi Fraternity, located at Sacramento State University. The objects of this chapter shall be the same as those set forth in the Constitution of Pi Kappa Phi Fraternity.",
    "points": null,
    "categories": [
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 212
  },
  {
    "name": "Pilipino Students of Art and Culture",
    "clubUrl": "https://csus.campusgroups.com/psac/",
    "description": "The purpose of this organization is to promote and showcase the Pilipino American culture and history through performing arts by means of a cultural celebration by the name of Pilipino Cultural Night (PCN). PCN uses traditional dance, song, and drama centered around a script to convey contemporary issues in the Pilipino American community. PSAC collaborates with other Pilipino American Organizations on campus.",
    "points": 38,
    "categories": [
      "Arts & Media",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "History / Philosophy / Religious Studies",
      "Music / Performing Arts"
    ],
    "id": 213
  },
  {
    "name": "Planned Parenthood Generation Action",
    "clubUrl": "https://csus.campusgroups.com/ppga/",
    "description": "The purpose of this organization is to serve as a college chapter under Planned Parenthood Advocates Mar Monte and Planned Parenthood Federation of America. Planned Parenthood Generation Action at Sac State aims to: organize events to educate and mobilize the student body on issues affecting sexual health and reproductive rights, connect students to local Planned Parenthood health centers, and serve as a pro Planned Parenthood presence on campus.Planned Parenthood Generation Action, believes in the fundamental right of every individual to manage their health. PPGA supports full access to comprehensive reproductive and complementary health care services in settings that preserve and protect the essential privacy and rights of each individual; advocates public policies that guarantee these rights and ensure access to such services; supports access to medically accurate educational programs that enhance understanding of human sexuality.",
    "points": 125,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 214
  },
  {
    "name": "Pre-Dental Association",
    "clubUrl": "https://csus.campusgroups.com/pda/",
    "description": "The Pre-Dental Association at the California State University, Sacramento, is a student-run organization that strives to provide for students who are interested in Dental Assisting, Pre-Hygiene (RDH) and Pre-Dental (DDS/DMD) with valuable information and resources about the dental field which may aid them in acceptance to dental school.",
    "points": null,
    "categories": [
      "Professional",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing"
    ],
    "id": 215
  },
  {
    "name": "Pre-Optometry Club",
    "clubUrl": "https://csus.campusgroups.com/preoptometry/",
    "description": "The purpose of this organization is to prepare students at California State University, Sacramento for admittance to colleges of optometry and familiarize students with the field. We will inform members of application process and provide guidance on requirements for optometry school. Throughout the semester, we will host aÂ variety of guest speakers. Members will be able to visit colleges of optometry through field trips. We will also work towards having events on campus promoting eye health. Volunteer and internship opportunities will be facilitated in order to provide club members with more hands-on experience within the field of optometry.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 216
  },
  {
    "name": "Pre-Physical Therapy Organization",
    "clubUrl": "https://csus.campusgroups.com/prept/",
    "description": "The purpose of this organization is to provide members with information about becoming a licensed physcial therapist and help them become competative candidates for admission into graduate level physical therapy schools .",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [],
    "id": 217
  },
  {
    "name": "Pre-Physician Assistant Association",
    "clubUrl": "https://csus.campusgroups.com/prepa/",
    "description": "The purpose of this organization is to inform and educate students about a possible future career as a Physician Assistant. We will also provide resources and opportunities for our fellow peers to be successful in pursuing their dreams in this growing field.",
    "points": 10,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 218
  },
  {
    "name": "Precast/Prestressed Concrete Institute Club",
    "clubUrl": "https://csus.campusgroups.com/PPCIC/",
    "description": "The purpose of this organization is to explore the possibilities of reinforced concrete structures and to provide students with the opportunity to apply their in-class knowledge directly with industry through the design, fabrication, and construction of a pre-cast/pre-stressed concrete beam. The \"Big Beam\" competition is hosted on a national level and allows students an amazing opportunity to showcase their knowledge, teamwork skills, structural engineering, and construction management talents. Additionally, as a returning member/officer to the club, be given the opportunity to attend the PCI National Convention hosted annually with the possibility to compete in Project Precast.",
    "points": 12,
    "categories": [
      "Academic",
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction",
      "Art / Design",
      "Engineering"
    ],
    "id": 219
  },
  {
    "name": "PRIDE Center",
    "clubUrl": "https://www.csus.edu/student-affairs/centers-programs/pride-center/",
    "description": "Membership Benefits",
    "points": 840,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 220
  },
  {
    "name": "Print Club",
    "clubUrl": "https://csus.campusgroups.com/printclub/",
    "description": "The purpose of this organization is to increase interest in the printmaking department, provide educational experiences, and raise awareness of the printmaking focus.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 221
  },
  {
    "name": "Project Rebound",
    "clubUrl": "https://csus.campusgroups.com/projectrebound/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 222
  },
  {
    "name": "Psi Chi International Honor Society in Psychology",
    "clubUrl": "https://csus.campusgroups.com/psichi/",
    "description": "The purpose of Psi Chi shall be to encourage, stimulate, and maintain excellence in scholarship of the individual members in all fields, particularly in psychology, and to advance the science of psychology.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Psychology"
    ],
    "id": 223
  },
  {
    "name": "Psychology Society",
    "clubUrl": "https://csus.campusgroups.com/psychsociety/",
    "description": "The purpose of Psychology Society shall be to improve the University and local community through community service projects as well as to enhance the education and social experience of Psychology Society members.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Psychology"
    ],
    "id": 224
  },
  {
    "name": "Public Health Club",
    "clubUrl": "https://csus.campusgroups.com/publichealth/",
    "description": "The purpose of this organization is to supplement the academic, professional and community development of students interested in public health and health science through guest speakers, on-and-off campus events, activities, and other avenues.Â  To perform as both an informant and a source of information for greater awareness of the many aspects of public health and health science studies offered to the campus community.  To assist and disseminate information about paid and unpaid opportunities, internships and experiences related to the public health field (as well as related disciplines) by developing a network between community organizations, professionals in the field and students. To provide and connect members with social interactions through collaborations, events, and activities with related on-and-off campus entities.Â",
    "points": 5,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Health / Medicine / Nursing"
    ],
    "id": 225
  },
  {
    "name": "Public Relations Student Society of America",
    "clubUrl": "https://csus.campusgroups.com/PRSSA/",
    "description": "Section 1- To serve its members by enhancing their knowledge of public relations and providing access to professional development.ection 2- To serve the public relations profession by helping to develop highly qualified, well-prepared future professionals.Section 3- Engage students with businesses and government agencies in the greater Sacramento region, California, and the United States to increase program visibility and benefit the community at large.Section 4- Prepare students with skill sets that can be immediately applied to the private sector, government, and nonprofit work environments.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Political Science / Public Policy"
    ],
    "id": 226
  },
  {
    "name": "R.A.I.N.B.O.W. Organization",
    "clubUrl": "https://csus.campusgroups.com/rainbow/",
    "description": "The purpose of this organization is to provide an open and safe environment to speak freely on topics about equality and intersectionality in the field of speech pathology and audiology. Additionally, we hope to supply informative, real-life support to undergraduate, second bachelor degree (CSAD2B), and graduate students of all identities, primarily students of color, in a way that allows for a strong collective voice within the CSAD Department.",
    "points": null,
    "categories": [
      "Academic"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 227
  },
  {
    "name": "Read and Relax Book Club",
    "clubUrl": "https://csus.campusgroups.com/RandR/",
    "description": "The purpose of this organization is to enrich your reading experience and make new friends through the art of reading. Give you a reason and a way to relax in the company of like-minded individuals.",
    "points": 33,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 228
  },
  {
    "name": "Recreation Majors Association",
    "clubUrl": "https://csus.campusgroups.com/rma/",
    "description": "The purpose of this organization is to network with professionals within the field, to help the community through a variety of volunteer activities and to build relationships with other students.",
    "points": 65,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 229
  },
  {
    "name": "Residence Hall Association",
    "clubUrl": "https://csus.campusgroups.com/rha/",
    "description": "RHA is a governing body that will serve as a community-wide voice and promote the quality of life for all students residing in residence halls, in affiliation with California State University, Sacramento Housing and Residential Life.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 230
  },
  {
    "name": "Rock Climbing",
    "clubUrl": "https://csus.campusgroups.com/climbing/",
    "description": "The purpose of this organization is to promote friendship, learning, leadership, and teamworkthrough the sport of rock climbing, both recreationally and competitively.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 231
  },
  {
    "name": "Rowing Club",
    "clubUrl": "https://csus.campusgroups.com/rowing/",
    "description": "The purpose of this organization shall be to promote the general sport of rowing.Â",
    "points": null,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 232
  },
  {
    "name": "Royal Sting",
    "clubUrl": "https://csus.campusgroups.com/Royalsting/",
    "description": "A collegiate branch of Court of the Great Northwest Imperial Empire (CGNIE) The United Court of Sacramento, Redding, Chico , Stockton that strives to bring students of the LGBTQIA+ communities and allies together through inclusive mentorship, community building, philanthropic fundraising, pageantry, and fun.",
    "points": 9,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 233
  },
  {
    "name": "Sac Bhangra",
    "clubUrl": "https://csus.campusgroups.com/sacbhangra/",
    "description": "At Sac Bhangra, we are dedicated to fostering an inclusive and welcoming environment where everyone can join in the joy of dance. Through our shared passion for Bhangra, we aim to build a fun, conflict-free community that celebrates culture, spreads positivity, and strengthens connections through the art of dance.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Environmental / Sustainability",
      "Music / Performing Arts"
    ],
    "id": 234
  },
  {
    "name": "Sac Giddha",
    "clubUrl": "https://csus.campusgroups.com/sacGiddha/",
    "description": "The purpose of this organization is to celebrate and promote the rich cultural heritage of Punjab through the vibrant and traditional dance of Sac Giddha. We aim to foster a sense of community, pride, and artistic expression among our members, while striving for excellence in performances and competitions. Our focus is on refining our skills to participate in campus performances, where we proudly participate in showcases and represent our culture. By embracing the competitive spirit, we strive to achieve excellence while sharing the joy and beauty of Sac Giddha with diverse audiences.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 235
  },
  {
    "name": "Sac Modern Dance",
    "clubUrl": "https://csus.campusgroups.com/sacmodern/",
    "description": "to provide a safe space where people can grow as humans and dancers, express themselves through this art, & inspire others",
    "points": null,
    "categories": [
      "Arts & Media",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Music / Performing Arts"
    ],
    "id": 236
  },
  {
    "name": "Sac Punjabi's",
    "clubUrl": "https://csus.campusgroups.com/sacpunjabis/",
    "description": "We strive to spread awareness of the Punjabi community throughout Sac State. Members will be able to connect with one another and learn through various events such as active discussions and social gatherings.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 237
  },
  {
    "name": "Salsa Loca",
    "clubUrl": "https://csus.campusgroups.com/salsaloca/",
    "description": "We are Salsa Loca at Sac State .We are a non-for-profit club/organization on campus providing free dance lessons once a week. Â Our goal is to provide a safe welcoming environment where students and community members can relieve stress, anxiety, and improve their mental health and overall wellness through the expression of dancing latin music. We want to help inspire people to feel comfortable with themselves and improve their confidence, as well as teaching them about different Latin cultures.Â",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Education",
      "Environmental / Sustainability",
      "Music / Performing Arts"
    ],
    "id": 238
  },
  {
    "name": "Samahang Pilipino",
    "clubUrl": "https://linktr.ee/csussp",
    "description": "The purpose of this organization is to provide its members with the opportunity to actively participate and contribute to the learning of the Filipino culture; the opportunity to acquire and apply leadership skills within the club, the campus, and the community at large; a setting where networking is available for people with similar interests; and the ability to work with the community through volunteering and service activities.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 239
  },
  {
    "name": "Sanskruti Indian Cultural Group",
    "clubUrl": "https://csus.campusgroups.com/sanskruti/",
    "description": "The purpose of this organization is to celebrate and increase awareness of rich Indian culture. The name of the organization is derived from the Sanskrit language meaning culture. The club organizes various events including two festivals: Navratri and Dhuleti. Navratri, the festival of nine nights is a festival held in honour of the divine feminine. It includes dance performance in the form of Garba. Dhuleti is a festival of colors",
    "points": 5,
    "categories": [
      "Arts & Media",
      "Special Interest / Hobby",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 240
  },
  {
    "name": "School Psychology Association",
    "clubUrl": "https://csus.campusgroups.com/schoolpsych/",
    "description": "The purpose of this organization shall be to foster intellectual growth, encourage professional and social networking, and promote the field of school psychology.",
    "points": 5,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Psychology"
    ],
    "id": 241
  },
  {
    "name": "Secular Student Alliance",
    "clubUrl": "https://csus.campusgroups.com/ssc/",
    "description": "The purpose of this organization is to connect students interested in and to promote secularism and humanistic values.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 242
  },
  {
    "name": "Serna Center",
    "clubUrl": "https://csus.campusgroups.com/serna/",
    "description": "Membership Benefits",
    "points": 115,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 243
  },
  {
    "name": "Sigma Alpha Epsilon",
    "clubUrl": "https://csus.campusgroups.com/SAE/",
    "description": "The mission of the California Xi Chapter of the Sigma Alpha Epsilon Fraternity is: To conduct ourselves as True Gentleman in all our endeavors, as set forth by our creed. To be loyal by keeping the interests of our brothers and chapter in front of our individual wants and by holding the Fraternity above all other organizations when possible. To hold a high academic standard for the entire chapter by maintaining the highest possible grade point average (minimum 2.5 cumulative GPA). To demonstrate leadership and community outreach, not only within the University but also beyond the walls of our school by affecting the greater Sacramento community in a positive way.",
    "points": null,
    "categories": [
      "Academic",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 244
  },
  {
    "name": "Sigma Delta Alpha",
    "clubUrl": "https://csus.campusgroups.com/SDA/",
    "description": "To support each other academically, socially, and personally. To encourage the promotion and retention of all underrepresented groups at institutions of higher learning. To work with other organizations and our community. To promote all underrepresented cultures to the community. To conduct ourselves to cast a positive light upon the Fraternity, ourselves, and our community.",
    "points": null,
    "categories": [
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 245
  },
  {
    "name": "Sigma Delta Pi",
    "clubUrl": "https://csus.campusgroups.com/sigmadeltapi/",
    "description": "To honor those students who achieve excellence in the study of the Spanish language and the culture of the Spanish-speaking peoples.",
    "points": 2,
    "categories": [
      "Academic",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Literature / Languages"
    ],
    "id": 246
  },
  {
    "name": "Sigma Gamma Rho Sorority, Inc",
    "clubUrl": "https://csus.campusgroups.com/SGRho/",
    "description": "The purpose of Xi Epsilon Chapter is to enhance the quality of life within the community. Public service, leadership development and education of youth are the hallmark of the organization's programs and activities. Xi Epsilon Chapter addresses concerns that impact society educationally, civically and economically.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 247
  },
  {
    "name": "Sigma Kappa",
    "clubUrl": "https://csus.campusgroups.com/sigkap/",
    "description": "Sigma Kappa initiated members and new members have a responsibility to the sorority and should protect its reputation.Â Initiation into Sigma Kappa grants each member with an honor and responsibility. Each member must keep in mind the vows taken at initiation and strive to be faithful to those vows.Â Members of Sigma Kappa have an obligation to the national organization, sorority chapter, university, community, fellow members, and herself. It proudly denotes one who is spiritually sincere, morally conscious, and financially responsible.Â As Sigma Kappa women, we are responsible for representing our chapterâ€™s values and high ideals for achievement, as well as that of our neighbors, friends, family, and community. Good manners and proper behavior are essential in a sorority and everyday interaction.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 248
  },
  {
    "name": "Sigma Omega Nu",
    "clubUrl": "https://csus.campusgroups.com/sunnies/",
    "description": "The purpose of this sorority shall be to strive for sisterhood, scholastic excellence, self-improvement, and Latina awareness and provide community service on the University Campus of every corresponding Chapter, as well as in the community.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 249
  },
  {
    "name": "Sigma Omega Phi",
    "clubUrl": "https://csus.campusgroups.com/SOPhi/",
    "description": "Sigma Omega Phi Multicultural Sorority Inc. manifested its roots on April 26, 1990 at CSU Chico campus. Sigma Omega Phi believes in opening minds through culture, education, and unity. The Gamma Chapter was established at Sacramento State University on April 20, 2012. Due to the hard work and dedication of 5 sophisticated ladies, the Gamma Chapter has evolved. With an everlasting bond and morals formulated to withstand all obstacles, the sisters pride themselves on being the Sophisticated Few. Our Gamma Chapter has and continues to uphold to the values of education, community service, and sisterhood.",
    "points": null,
    "categories": [
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 250
  },
  {
    "name": "Sigma Omicron Pi",
    "clubUrl": "https://csus.campusgroups.com/SOPi/",
    "description": "The purpose of this organization is to promote lifelong friendships, unity, leadershipÂ training, and community service. Its emphasis is to foster and encourageÂ Asian-American awareness.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 251
  },
  {
    "name": "Sigma Phi Epsilon",
    "clubUrl": "https://csus.campusgroups.com/sigep/",
    "description": "The objectives of this organization are: to uphold, develop and strengthen the character of its members. To encourage those principles which are essential in the discharge of the duties which naturally evolve upon an individual as a member of society. To impress upon its members the true significance of fraternal relationships and balanced man ideals. To aid and sustain, as far as possible, the government and discipline of California State University, Sacramento. To promote scholarship. To uphold and follow the Standards code. To uphold the cardinal principles of Virtue, Diligence, and Brotherly Love.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Political Science / Public Policy"
    ],
    "id": 252
  },
  {
    "name": "Sigma Pi",
    "clubUrl": "https://csus.campusgroups.com/sigmapi/",
    "description": "The objects of the Fraternity shall be specifically: (a) To establish a brotherhood among students, and men of learning, who are connected with the institutions of higher education. (b) To establish and maintain an aristocracy of learning, consisting of the ablest men in all fields of study. (c) To raise the standards of morality and develop the character of men. (d) To diffuse culture and encourage chivalry among men. (e) To promote the spirit of civic righteousness and quicken the national conscience to the end that only men of character, integrity, and efficiency shall be elected or appointed to positions of honor and responsibility.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Political/Advocacy",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 253
  },
  {
    "name": "Sigma Pi Alpha",
    "clubUrl": "https://csus.campusgroups.com/ellas/",
    "description": "The letters we wear represent our sisterhood, our commitment to each other, and to our goals. For ourselves we are a sisterhood of academic and personal support, trust, and understanding; For our campus we sponsor informative and social activities. We support our fellow Raza organizations and network with other campus resources and groups; For our community our priority is to promote higher education through mentoring, tutoring, scholarships and to overall support Chicana/Latina youth. However, we address other community issues as well.Â",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 254
  },
  {
    "name": "Sigma Theta Psi",
    "clubUrl": "https://csus.campusgroups.com/STP/",
    "description": "The purpose of the Corporation is to form a relationship amongst a group of individuals who will carry on a lifetime friendship with each other. They will create a special bond and learn to grow spiritually. This Corporation will serve as a support group, educationally and emotionally. In addition, it will provide social and community involvement opportunities for the group.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 255
  },
  {
    "name": "Sikh Student Association",
    "clubUrl": "https://csus.campusgroups.com/ssa/",
    "description": "Sikh Student Association is an organization at California State University, Sacramento oriented to unite anyone that is interesting in learning and/or advancing their knowledge of Sikhi. The members will be able to connect with one another and learn through various events such as active discussions, social gatherings, and kirtan nights.",
    "points": null,
    "categories": [
      "Professional",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 256
  },
  {
    "name": "Ski & Snowboard Club",
    "clubUrl": "https://csus.campusgroups.com/snowclub/",
    "description": "The purpose of this organization is to promote ski and snowboard safety, provide opportunities for students to experience snowboarding and skiing at the most fulfilling level and to bring together individuals of the college community in a club for social and recreational activities.",
    "points": null,
    "categories": [
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 257
  },
  {
    "name": "Ski and Snowboard Team",
    "clubUrl": "https://csus.campusgroups.com/snowteam/",
    "description": "The purpose of this organization is to provide the opportunity for students to learn, improve, and master collegiate-level winter sports. Our program is dedicated to creating an environment that promotes friendly competition, an active lifestyle, and long-lasting friendships while developing our skills as competitive athletes.",
    "points": null,
    "categories": [
      "Academic",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Environmental / Sustainability"
    ],
    "id": 258
  },
  {
    "name": "Social Sciences and Interdisciplinary Joint Council",
    "clubUrl": "https://csus.campusgroups.com/SSISJC/",
    "description": "The purpose of this organization is to provide a voice for the students of the College of Social Sciences and interdisciplinary Studies (SSIS) and to extend communication between the students of SSIS, SSIS organizations, SSIS faculty, staff, and administration and Associated Students Incorporated.",
    "points": 7,
    "categories": [],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 259
  },
  {
    "name": "Social Work Student Association",
    "clubUrl": "https://csus.campusgroups.com/swsa/",
    "description": "The SWSA is dedicated to making a difference in the lives of others as well as our members. We strive as a group to bring a strong awareness to social work, and the opportunities it offers, through dedication, compassion, and integrity. We also seek to provide information and resources that emphasize our roles and impact as future social workers. We are committed to bringing together our peers, our professors, and individuals from our community to promote health and wellness, family, friends, diversity, equality, and many other values that social work has to offer. 2.The SWSA is committed to:a  Representing the core values and ethical principles of the social work profession, the Counsel on Social Work Education, and the National Association of Social Workers Code of Ethics b. Advocating for fellow social work students, our campus community, and our surrounding professional communities to meet professional, student, and client needs. c. Embracing the full diversity of race, creed, national origin, gender, culture, class, sexual orientation, gender identity, age, and ability, which make up our student body.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Social Work / Sociology"
    ],
    "id": 260
  },
  {
    "name": "Society for Industrial and Applied Mathematics Student Chapter",
    "clubUrl": "https://csus.campusgroups.com/siam/",
    "description": "The purpose of this organization is to further the application of mathematics to industry and science; To promote basic research in mathematics leading to new methods and techniques useful to industry and science; To provide media for the exchange of information and ideas between mathematicians and other technical and scientific personnel. Purposes of the Chapter shall be consistent with the objectives of SIAM. To provide opportunities for student forums and presentations. To promote interdisciplinary collaboration and interaction among students from applied mathematics, engineering, economics, and other related fields. To promote networking events to discuss career opportunities in applied mathematics",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Economics",
      "Engineering",
      "Mathematics",
      "Media / Journalism / Communications"
    ],
    "id": 261
  },
  {
    "name": "Society for the Advancement of Chicanos/Hispanics and Native Americans in Science Chapter",
    "clubUrl": "https://csus.campusgroups.com/sacnas/",
    "description": "To further the work of, to improve the effectiveness of, and to enhance the public understanding of and appreciation for Chicanos, Latinos, Native Americans, Alaska Natives, Native Hawaiians and other underrepresented minorities in science;2. To cooperate with other individuals, organizations, clubs, and other groups whose purposes include the achievement of public understanding for Chicanos, Latinos, Native Americans, Alaska Natives, Native Hawaiians and other underrepresented minorities in the sciences;3. To promote student recruitment and retention of Chicanos, Latinos, Native Americans, Alaska Natives, Native Hawaiians and other underrepresented minorities in science at California State University, Sacramento; and 4. To provide a forum for students from different science majors and science related majors to come together for academic, community service and social activities at California State University, Sacramento All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 262
  },
  {
    "name": "Society of Asian Scientists and Engineers",
    "clubUrl": "https://csus.campusgroups.com/SASE/",
    "description": "To prepare Asian heritage scientists, engineers, and technologists for success in the global business world, to celebrate diversity on campuses and in the workplace, and to provide opportunities for members to make contributions to their local communities. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 263
  },
  {
    "name": "Society of Hispanic Professional Engineers",
    "clubUrl": "https://csus.campusgroups.com/SoHisProEng/",
    "description": "Promote professional development among our members in the fields of Science, Technology, Engineering, and Mathematics (STEM). Reveal members full potential and provide opportunities to develop their leadership skills. Achieve academic excellence and retention among members. Unify and sustain the chapter through recruitment, retainment, fundraising, networking, and post-graduation success.Inspire Hispanic youth to pursue higher education through awareness, access, and support in STEM. Reciprocate the abundant support from the scholastic, local, and Hispanic communities. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 95,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education",
      "Engineering",
      "Mathematics"
    ],
    "id": 264
  },
  {
    "name": "Society of Manufacturing Engineers",
    "clubUrl": "https://csus.campusgroups.com/SME/",
    "description": "The purpose of this organization is to provide a gateway for people from every major to access the machine shop and learn skills for manufacturing including but not limited to 3D Printing, CNC machining, manual machining, CAD software, welding, composites, and soldering through our meetings and workshops. We also provide excellent opportunities for networking, designing, and manufacturing projects, and meeting potential employers.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 265
  },
  {
    "name": "Society of Physics Students",
    "clubUrl": "https://csus.campusgroups.com/sps/",
    "description": "The purpose of the Society of Physics Students (SPS) at California State University Sacramento, as a chapter of the Society of Physics Students (National), which falls under the umbrella organization of the American Institute of Physics, is to offer students a comprehensive platform for personal and professional development within the field of physics. While coursework provides a foundational understanding of physics, the SPS recognizes that a broader skill set is essential for students to flourish professionally. These chapters aim to foster these critical skills, including effective communication, leadership experience, and the establishment of personal networks. SPS provides students with opportunities to engage with professionals and peers, promoting education, collaboration, and networking within the local physics community and on a broader scale, encompassing research facilities, industry partners, and professionals worldwide. It serves as a hub for presenting scholarly work in professional meetings and journals, enabling students to gain valuable experience contributing to the scientific community. Furthermore, it actively engages in outreach services to the campus and local communities, sharing the wonders of physics and promoting science literacy. In addition, SPS organizes social and academic field trips. These field trips further enhance the educational and social aspects of the SPS experience. Beyond the local level, SPS offers students the opportunity for enrichment experiences that span regional, national, and international boundaries. These experiences broaden students' perspectives and expose them to various facets of the physics community. In essence, the SPS at California State University Sacramento, in alignment with the broader SPS mission, is dedicated to helping students transform into well-rounded, contributing members of the professional physics community by providing a comprehensive and enriching educational experience both inside and outside the classroom, and by facilitating collaboration and engagement.",
    "points": 24,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Media / Journalism / Communications",
      "Physics"
    ],
    "id": 266
  },
  {
    "name": "Society of Women Engineers",
    "clubUrl": "https://csus.campusgroups.com/SoWoEng/",
    "description": "The purpose of this organization is to further the objectives of SWE by empowering individuals committed to the mission to achieve their full potential as engineers and leaders, promoting the engineering profession as a positive force for improving the quality of life, and demonstrating the value of diversity.",
    "points": 85,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 267
  },
  {
    "name": "Sociology Club",
    "clubUrl": "https://csus.campusgroups.com/socclub/",
    "description": "The purpose of this club is to give Sociology majors, and all those interested in the subject, the opportunity to learn about career and graduate school options within the field. In addition, Sociology Club members will have the opportunity to socialize and build professional connections with those who express similar interests, as well as volunteer together for the betterment of the greater Sacramento community.",
    "points": 10,
    "categories": [
      "Academic",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Social Work / Sociology"
    ],
    "id": 268
  },
  {
    "name": "Softball Club",
    "clubUrl": "https://csus.campusgroups.com/softball/",
    "description": "The purpose of this organization is to bring together women interested in playing softball at a competitive level outside of NCAA",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 269
  },
  {
    "name": "Soran Bushi",
    "clubUrl": "https://csus.campusgroups.com/soranbushi/",
    "description": "The purpose of this organization isÂ to increase awareness of Japanese cultural dances at California State University, Sacramento and foster a stronger community between Japanese and American students on campus.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Literature / Languages"
    ],
    "id": 270
  },
  {
    "name": "South and Central Asian Student Association",
    "clubUrl": "https://csus.campusgroups.com/scasa/",
    "description": "Advocating for underrepresented South and Central Asian students on campus and promoting awareness of their presence. Additionally, we want to create learning environments for everyone through events. The club would be education-based (history), and teach individuals.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education",
      "History / Philosophy / Religious Studies"
    ],
    "id": 271
  },
  {
    "name": "Southwest Asian & North African (SWANA) Center",
    "clubUrl": "https://csus.campusgroups.com/swana/",
    "description": "Membership Benefits",
    "points": 5,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 272
  },
  {
    "name": "Stingerettes",
    "clubUrl": "https://csus.campusgroups.com/Stingerettes/",
    "description": "To inspire confidence, strength, and empowerment through the art of dance. We are dedicated to performing at our highest level, continuously striving for excellence, and expressing ourselves fully through movement. Our core values include confidence and fierceness (embodied in our concept of \"sass\"), teamwork, integrity, precision, and personal growth.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Music / Performing Arts"
    ],
    "id": 273
  },
  {
    "name": "Street Dance Club",
    "clubUrl": "https://csus.campusgroups.com/streetdance/",
    "description": "The purpose of this organization is to provide a space for people to share and practice their knowledge of street dance culture.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 274
  },
  {
    "name": "Student Academy of Audiology",
    "clubUrl": "https://csus.campusgroups.com/saa/",
    "description": "The purpose of this organization is to serve as a collective voice for students and advance the rights, interests, and welfare of students pursuing careers in audiology. The SAA introduces students to lifelong involvement in activities that promote and advance the profession of audiology and provides services, information, education, representation, and advocacy for the profession, the students, and the public we serve.",
    "points": null,
    "categories": [
      "Political/Advocacy"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 275
  },
  {
    "name": "Student Affairs",
    "clubUrl": "https://csus.campusgroups.com/studentaffairs/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 276
  },
  {
    "name": "Student Affairs IT",
    "clubUrl": "https://csus.campusgroups.com/sait/",
    "description": "Membership Benefits",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 277
  },
  {
    "name": "Student Alumni Association",
    "clubUrl": "https://csus.campusgroups.com/studentalum/",
    "description": "The purpose of this organization is to forge lifelong connections through distinctive student experiences and alumni engagement.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 278
  },
  {
    "name": "Student Association for Applied Behavior Analysis",
    "clubUrl": "https://csus.campusgroups.com/saaba/",
    "description": "The mission of the Student Association for Applied Behavior Analysis (SAABA) is to promote the study of Applied Behavior Analysis by providing its members with the opportunity to learn more about the career and research opportunities in the field through social networking, workshops, conferences and guest lecturer events.",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 279
  },
  {
    "name": "Student Association For Industrial-Organizational Psychology (I-O)",
    "clubUrl": "https://csus.campusgroups.com/SAIOP/",
    "description": "The purpose of this organization is to provide students interested in Industrial-Organizational Psychology, Workplace Psychology, or related fields with information about I-O psychology, career and educational opportunities, and networking through club events.",
    "points": 22,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Engineering",
      "Psychology"
    ],
    "id": 280
  },
  {
    "name": "Student Association of Laboratory Scientists",
    "clubUrl": "https://csus.campusgroups.com/sals/",
    "description": "The purpose of this organization is to provide students in the laboratory sciences with job information and contacts, internship opportunities, and graduate program information.",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 281
  },
  {
    "name": "Student Bible Study Club",
    "clubUrl": "https://csus.campusgroups.com/SBSC/",
    "description": "The purpose of this organization is to provide a welcoming space for students of all backgrounds to meet weekly and engage in open, thoughtful dialogue on a portion of the Bible. Through group discussion and shared exploration, the club looks to deepen understanding of the Biblical story, have respectful conversations, and promote personal reflection. The club has no specific religious affiliation – all are welcome.",
    "points": null,
    "categories": [
      "Academic",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 282
  },
  {
    "name": "Student Counseling Society",
    "clubUrl": "https://csus.campusgroups.com/scs/",
    "description": "The purpose of this organization is to promote professionalism and excellence in the counseling profession, build connections, and serve as a support group for students interested in the fields of counseling",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 283
  },
  {
    "name": "Student Economics Association",
    "clubUrl": "https://csus.campusgroups.com/sea/",
    "description": "The purpose of the Student Economics Association (SEA) shall be to further the interests of all students interested in economics through the promotion of scholarship, the development of student leaders who are committed to service within their community, and the cultivation of fellowship among students, faculty and staff at Sacramento State.",
    "points": 8,
    "categories": [
      "Professional",
      "Religious/Spiritual",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Economics"
    ],
    "id": 284
  },
  {
    "name": "Student Fashion Association",
    "clubUrl": "https://csus.campusgroups.com/sfa/",
    "description": "The Student Fashion Association is an organization that strives to be more involved in the Fashion Industry. Our organization gives opportunities that can lead to bigger dreams and goals, with your involvement and participation. We work closely with local designers from Sacramento and events like Sacramento Fashion Week and networking with many industry professionals. SFA comes together as a group of hard-working students to create strong bonds, career opportunities, learn more about the industry in itself, and explore the world of fashion.",
    "points": 24,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 285
  },
  {
    "name": "Student Health, Counseling, and Wellness Services",
    "clubUrl": "https://csus.campusgroups.com/shcws/",
    "description": "Membership Benefits",
    "points": 507,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 286
  },
  {
    "name": "Student Interprofessional Education",
    "clubUrl": "https://csus.campusgroups.com/sipe/",
    "description": "The purpose of this organization is to socialize, network, and discuss/learn about current healthcare topics aiming to provide collaborative patient-centered care and promote the triple aim of health care: Enhance patient experience, improve the health of the community, and reduce the cost of health care.",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Health / Medicine / Nursing"
    ],
    "id": 287
  },
  {
    "name": "Student Investment Fund Club",
    "clubUrl": "https://csus.campusgroups.com/SIFC/",
    "description": "The purpose of this organization is a group of students (all majors welcome) interested in learning more about Student Investment Fund management and furthering their knowledge in the field. Student Investment Fund Club is the community that fosters the value of Student Investment Fund Management and advances the practice and profession of investment management. Other purposes of the Student Chapter are to give students the opportunity to learn about investment management, have exposure to financial professionals, obtain internships and employment opportunities and develop interpersonal and leadership skills.",
    "points": 2,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 288
  },
  {
    "name": "Student Organizations and Leadership",
    "clubUrl": "https://www.csus.edu/soal",
    "description": "Student Organizations & Leadership (SO&L) advocates for students and contributes to learning, development, and retention by providing opportunities for involvement, leadership, and empowerment through a wide variety of organizations and programs. These experiences nurture campus pride and student success to advance an inclusive and equitable community.",
    "points": 1998,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 289
  },
  {
    "name": "Student Parent Scholars United",
    "clubUrl": "https://csus.campusgroups.com/SPSU/",
    "description": "The purpose of this organization to bring student-parents on campus together and create a village while also advocating for and bringing awareness to our unique population.",
    "points": 16,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 290
  },
  {
    "name": "Students for Justice in Palestine",
    "clubUrl": "https://csus.campusgroups.com/sjp/",
    "description": "The purpose of this organization is to bring awareness and activism for the occupation in Palestine. We are an advocacy group of students, faculty, and community members at CSU Sacramento devoted to the liberation of Palestine with a one state solution, promoting justice, human rights, and a call to an end of its illegal occupation. We bring awareness of the occupation and apartheid by Israel against indigenous Palestinians though protests, memorials, vigils, educational events, and actions to provide visualization of the Palestinian struggle. We serve with the goal of highlighting the Palestinian narrative in their fight for self-determination and full decolonization",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Political/Advocacy",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 291
  },
  {
    "name": "Swim Club",
    "clubUrl": "https://csus.campusgroups.com/Swim/",
    "description": "The purpose of this club would be to bring together people who enjoy swimming and get some exercise. All levels are welcome and we will have fun and train.",
    "points": null,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 292
  },
  {
    "name": "Symphonic Wind Ensemble",
    "clubUrl": "https://csus.campusgroups.com/symphonicwindensemble/",
    "description": "The purpose of this organization is to enrich the musical experiences of instrumental performers at Sacramento State through the instruction of wind band literature.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Literature / Languages",
      "Music / Performing Arts"
    ],
    "id": 293
  },
  {
    "name": "Symphony Orchestra",
    "clubUrl": "https://csus.campusgroups.com/symphonyorchestra/",
    "description": "The purpose of this organization is to enrich the musical experiences of instrumental performers at Sacramento State through the instruction of orchestral literature.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Literature / Languages",
      "Music / Performing Arts"
    ],
    "id": 294
  },
  {
    "name": "Tabletop Activities and Gaming",
    "clubUrl": "https://csus.campusgroups.com/TAG/",
    "description": "The purpose of this organization is to create and serve a tabletop gaming community on campus; allowing students to interact and enjoy gaming activities with their peers. We aspire to create an environment that will allow creativity to flourish through the use of workshops and discussions surrounding the numerous tabletop hobbies the club will represent. As well as host events for the recreation of the student body .",
    "points": 6,
    "categories": [
      "Service/Volunteer",
      "Special Interest / Hobby",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability",
      "Esports / Gaming"
    ],
    "id": 295
  },
  {
    "name": "Tau Beta Pi - CA-U",
    "clubUrl": "https://csus.campusgroups.com/taubetapi/",
    "description": "To mark in a fitting manner those who have conferred honor upon their Alma Mater by distinguished scholarship and exemplary character as students in engineering, or by their attainments as alumni in the field of engineering.",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 296
  },
  {
    "name": "Tau Kappa Epsilon",
    "clubUrl": "https://csus.campusgroups.com/TKE/",
    "description": "To aid men in their mental, moral and social development for life. To contribute to the advancement of society through the personal growth of our members and their service to others. To create lifelong relationships that enhance educational, interpersonal, community and professional success.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 297
  },
  {
    "name": "Tennis Club",
    "clubUrl": "https://csus.campusgroups.com/tennis/",
    "description": "The purpose of this organization is to introduce an athletic social group to participate and play tennis, to compete in the Tennis On Campus League, to meet new people, to improve our tennis skills, and to have fun doing so.",
    "points": null,
    "categories": [
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 298
  },
  {
    "name": "The Beavers",
    "clubUrl": "https://csus.campusgroups.com/HeavyCivil/",
    "description": "The purpose of this organization is to provide an awareness of the Heavy Civil Construction Industry. We are committed to introduce individuals from all grade levels into the Heavy Civil world of construction",
    "points": null,
    "categories": [],
    "fieldsOfStudy": [
      "Architecture / Construction",
      "Engineering"
    ],
    "id": 299
  },
  {
    "name": "The Belonging Collective",
    "clubUrl": "https://csus.campusgroups.com/belongingcollective/",
    "description": "The Belonging Collective provides a space where multicultural students can embrace their emerging adult identities. This space fosters a sense of belonging through the exploration of students’ intersecting identities (e.g. ethnicity, race, gender, sexuality, etc.) within the context of the world around them. Our club supports the academic, professional, and personal success of students as they navigate the challenges and opportunities of college.",
    "points": null,
    "categories": [
      "Academic",
      "Professional"
    ],
    "fieldsOfStudy": [],
    "id": 300
  },
  {
    "name": "The Black Student-Athlete Alliance",
    "clubUrl": "https://csus.campusgroups.com/TBSA/",
    "description": "The purpose of this organization is to create a welcoming, inclusive and supportive community in which our main mission is to amplify our voices, share our unique experiences, and foster a thriving sense of community that celebrates our achievements and resilience. We are committed to excelling both in competition as well as in the classroom. We strive for excellence, recognizing that our journeys extend beyond sports. We aim to inspire future generations, advocate for equity, and create a legacy of academic and athletic success that uplifts our communities and showcases the power of our diverse narratives. Together, we will champion our aspirations and the collective strength of our identities. All students regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 5,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 301
  },
  {
    "name": "The Elohist",
    "clubUrl": "https://csus.campusgroups.com/TheElohist/",
    "description": "To share the Love of Heavenly Mother to all.",
    "points": 15,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 302
  },
  {
    "name": "The French Connections",
    "clubUrl": "https://csus.campusgroups.com/frenchconnections/",
    "description": "Are you a Francophile? If you are interested in learning and discovering more about the French language through its cultures and histories... Yes, you are! The French Connections is the place to learn, meet people, and immerse yourself in a dynamic network of French speakers who are passionate about promoting and celebrating all of our beautiful and more diverse than you can imagine Francophone cultures! Through this unique Sac State inclusive and open to all community, join us in cultural celebrations, conversation practice, networking or guest speaker events, and so much more! Thinking about joining? Or just want to make sure that you never miss any news from the club? Don't hesitate to contact us by sending an email at thefrenchconnectionscsus@gmail.com and let us know your interest !Au plaisir de vous revoir bientot!",
    "points": null,
    "categories": [
      "Professional",
      "Service/Volunteer",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Literature / Languages"
    ],
    "id": 303
  },
  {
    "name": "The Hive",
    "clubUrl": "https://csus.campusgroups.com/thehive/",
    "description": "The purpose of The Hive is to develop the ideas of individuals and foster entrepreneurial growth and action.",
    "points": 15,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 304
  },
  {
    "name": "The Hive Collective",
    "clubUrl": "https://csus.campusgroups.com/THC/",
    "description": "The purpose of this organization is to provide students with the opportunity to develop the technical, collaboration, and marketing skills with the purpose to creating production ready applications that solves real-world problems. The club will foster social connection by integrating respect and understanding through sharing common goals such as possible revenue generation and social good through the development of these applications. This club is open to all students, ideally for those who are motivated in creating new products and solving problems.",
    "points": 61,
    "categories": [],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 305
  },
  {
    "name": "The Hornet Journalism Club",
    "clubUrl": "https://csus.campusgroups.com/THJC/",
    "description": "The purpose of this organization is to foster journalism success for students throughout the Sacramento region. The club will coordinate and network with local high school and community college journalism programs to uplift student voices and encourage students to succeed in the journalism world.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 306
  },
  {
    "name": "The Navigators",
    "clubUrl": "https://csus.campusgroups.com/NavsAtSacState/",
    "description": "The mission of the Navigators, a missions organization, is to help individuals “To Know Christ, make Him known, and help others do the same”. In the collegiate branch, we are aiming to help college students learn who Jesus is and what He was about. We also offer one-to-one spiritual mentorship to help students be equipped and confident in sharing who Jesus is to others in their current collegiate context and also in their post grad contexts.",
    "points": null,
    "categories": [
      "Academic",
      "Professional",
      "Religious/Spiritual"
    ],
    "fieldsOfStudy": [],
    "id": 307
  },
  {
    "name": "The Social  and Emotional Learning Project",
    "clubUrl": "https://csus.campusgroups.com/SEL/",
    "description": "The purpose of this organization is to focus on community service within the Sacramento Unified School District geared towards social and emotional learning competencies, such as responsible decision-making, self-management, self-awareness, social awareness, and healthy relationship skills.",
    "points": null,
    "categories": [
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 308
  },
  {
    "name": "The University Union",
    "clubUrl": "https://csus.campusgroups.com/universityunion/",
    "description": "Membership Benefits",
    "points": 655,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 309
  },
  {
    "name": "The WELL",
    "clubUrl": "https://thewellatsacstate.com/",
    "description": "Membership Benefits",
    "points": 455,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 310
  },
  {
    "name": "Transportation Challenge",
    "clubUrl": "https://csus.campusgroups.com/TEC/",
    "description": "Develop transportation engineering deliverables for submission to the annual ASCE Mid - Pacific Student Conference",
    "points": null,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 311
  },
  {
    "name": "Turning Point USA",
    "clubUrl": "https://tpusacsus.weebly.com/",
    "description": "Turning Point USA's mission is to educate students about the importance of fiscal responsibility, free markets, and capitalism through innovative campus activism and non-partisan, thought-provoking discussion",
    "points": null,
    "categories": [
      "Political/Advocacy"
    ],
    "fieldsOfStudy": [],
    "id": 312
  },
  {
    "name": "United Sorority and Fraternity Council",
    "clubUrl": "https://csus.campusgroups.com/USFC/",
    "description": "The purpose of the USFC shall be to assist culturally diverse sororities and fraternities in the achievement of their noble purposes and to provide a forum for the regulation of organization interactions.  The USFC shall act as a liaison between our member organizations and the university administration by establishing a communicative network for all culturally diverse sororities and fraternities to promote unity amongst the organizations and the university community.Â",
    "points": 77,
    "categories": [
      "Professional",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [],
    "id": 313
  },
  {
    "name": "Vertical Flight Society",
    "clubUrl": "https://csus.campusgroups.com/verticalflightsociety/",
    "description": "The purpose of this organization is to provide student engagement in academic and professional activities that promote vertical flight research through networking, project-based support, and involvement in an international organization (VFS) that advances the theory and practices of the science of vertical flight vehicles. The VFS Student Chapter will encourage and support participation in international rotorcraft design competitions and VFS-sponsored events and scholarships.",
    "points": null,
    "categories": [
      "Academic",
      "Arts & Media",
      "Professional"
    ],
    "fieldsOfStudy": [
      "Art / Design"
    ],
    "id": 314
  },
  {
    "name": "Veterans Club",
    "clubUrl": "https://csus.campusgroups.com/SOD/",
    "description": "The purpose of this organization is Organize fellowship activities for veterans and other members, provide assistance for students transitioning from military service to the educational experience, advance interests common to the campus veteran community, increase awareness of veteran life to interested non-veteran members, and offer support for veterans who may be having difficulty coping with past traumatic military experiences.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Religious/Spiritual",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [],
    "id": 315
  },
  {
    "name": "Veterans Success Center",
    "clubUrl": "https://csus.campusgroups.com/veterans/",
    "description": "Membership Benefits",
    "points": 15,
    "categories": [],
    "fieldsOfStudy": [],
    "id": 316
  },
  {
    "name": "Video Game Design Club",
    "clubUrl": "https://csus.campusgroups.com/videodesignclub/",
    "description": "The purpose of this organization is to be a dynamic and inclusive space for individuals interested in exploring the multifaceted world of video game creation. We extend a warm welcome to all students, regardless of their skill level or academic background. Our club is designed to bring together a diverse range of talents, from programming and computer science to art, storytelling, music, and more.",
    "points": 5,
    "categories": [
      "Academic",
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Art / Design",
      "Computer Science",
      "Music / Performing Arts"
    ],
    "id": 317
  },
  {
    "name": "Vietnamese Student Association",
    "clubUrl": "https://csus.campusgroups.com/vsa/",
    "description": "The purpose of this organization is to promote and embrace Vietnamese culture and history while providing a safe, welcoming community. It is of utmost importance the association promotes diversity and inclusivity, avoiding the creation of a segregated community.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "History / Philosophy / Religious Studies"
    ],
    "id": 318
  },
  {
    "name": "Vocal Jazz Club",
    "clubUrl": "https://csus.campusgroups.com/vocaljazzclub/",
    "description": "The purpose of this organization is to promote and nurture vocal jazz music of the past and present through our own Sac State Jazz Singers ensemble.",
    "points": null,
    "categories": [
      "Arts & Media"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 319
  },
  {
    "name": "Voices of Diversity",
    "clubUrl": "https://csus.campusgroups.com/VoD/",
    "description": "Our club, rooted in the Psychology Department at Sac State, is dedicated to fostering a sense of community and inclusivity. Our goal is to promote spaces where peers feel they truly belong within academic settings. Our mission centers on offering tools and resources that enhance wellness, cultivate student success, and support personal growth through intentional community engagement, we want to create a sense of belonging. This initiative began with the department’s Diversity, Equity, and Inclusion (DEI) efforts, and although initial funding was cut, we believe so strongly in its impact that we transitioned it into a student-led organization to provide continuity and expand its reach.",
    "points": null,
    "categories": [
      "Academic",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Psychology"
    ],
    "id": 320
  },
  {
    "name": "Water Resources and Environmental Engineering Club",
    "clubUrl": "https://csus.campusgroups.com/cweaawwa/",
    "description": "The goal of the Water Resources and Environmental Engineering Club at California State University, Sacramento is to unite the students with interest in the Environmental Engineering discipline in order to further their networking opportunities with peers, members of the faculty and staff, and people in the industry. The specific objectives of this Chapter shall be to promote the common professional interests of its members and to further the purposes of the Chapter through not-for-profit activities, including, but not limited to, education, training, meetings, publications, and philanthropic work.",
    "points": null,
    "categories": [
      "Professional"
    ],
    "fieldsOfStudy": [
      "Education",
      "Engineering",
      "Environmental / Sustainability"
    ],
    "id": 321
  },
  {
    "name": "Water Treatment Club",
    "clubUrl": "https://csus.campusgroups.com/watertreatmentclub/",
    "description": "The purpose of this organization is to develop students' interest in water treatment and how it relates to engineering. This organization forms a team of students to compete in the ASCE Mid-Pacific Water Treatment Competition every spring.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [
      "Engineering"
    ],
    "id": 322
  },
  {
    "name": "West Coast Stingers",
    "clubUrl": "https://csus.campusgroups.com/WCS/",
    "description": "Our mission is to grow a vibrant and inclusive community of dancers at Sacramento State, bringing together individuals of all backgrounds. We aim to inspire creativity, foster meaningful connections, and promote well-being through diverse dance styles and shared experiences. We strive to cultivate a supportive space where students can develop a passion for dance, social skills, and contribute to the dynamic culture of our campus and local community.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Music / Performing Arts"
    ],
    "id": 323
  },
  {
    "name": "Women in Business",
    "clubUrl": "https://csus.campusgroups.com/WIB/",
    "description": "The purpose of this organization is to provide undergraduate women interested in business an opportunity to make connections in the business world, and promote their personal and professional development in order to become leaders in the business community. Anyone, regardless of sex, can participate in the group if they are committed to the mission of the group.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Business / Finance / Accounting"
    ],
    "id": 324
  },
  {
    "name": "Women in Construction",
    "clubUrl": "https://csus.campusgroups.com/womeninconstruction/",
    "description": "The purpose of this organization is to support women pursuing careers and interests in the construction industry. We aim to create a lively community where people supporting women in the construction industry can connect, share knowledge, and motivate one another. Through networking, industry exposure, and professional development we strive to promote diversity, inclusion and advance the presence and influence of women in the construction field. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Architecture / Construction"
    ],
    "id": 325
  },
  {
    "name": "Women in Law",
    "clubUrl": "https://csus.campusgroups.com/WIL/",
    "description": "Our Mission is to uplift our community and help put members on a path to a successful career in law. We encourage our members to follow their legal passions and provide resources for them to succeed. We strive to provide a space for our members to learn, grow, and connect with others who share their same goals and ambitions.",
    "points": null,
    "categories": [
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Law / Pre-Law"
    ],
    "id": 326
  },
  {
    "name": "Women in Physics and Astronomy",
    "clubUrl": "https://csus.campusgroups.com/womeninpanda/",
    "description": "Join a diverse community of brilliant minds and fearless trailblazers. Our club provides a supportive and empowering space for women and other gender minorities pursuing their passion for physics, fostering camaraderie, mentorship, and academic excellence. Together, we will break down barriers, shatter glass ceilings, and pave the way for a future where our voices are at the forefront. Discover your potential, ignite your curiosity, and unleash your brilliance with WiPA! All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Service/Volunteer",
      "Special Interest / Hobby"
    ],
    "fieldsOfStudy": [
      "Physics"
    ],
    "id": 327
  },
  {
    "name": "Women in STEM",
    "clubUrl": "https://csus.campusgroups.com/wistem/",
    "description": "The purpose of this organization is to unite all those who support the advancement of STEM majors and careers.",
    "points": 19,
    "categories": [
      "Cultural/Identity"
    ],
    "fieldsOfStudy": [],
    "id": 328
  },
  {
    "name": "Women Who Lift",
    "clubUrl": "https://csus.campusgroups.com/girlgains/",
    "description": "The purpose of this organization is to promote female weightlifting and empower individuals from all backgrounds to feel confident and strong in the gym. Recognizing that the gym can be an intimidating space for some, our goal is to build a supportive community. We aim to educate students on fitness and support everyone on their fitness journey, whether they are beginners or avid lifters. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 20,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 329
  },
  {
    "name": "Women's & Gender Studies Club",
    "clubUrl": "https://csus.campusgroups.com/WGS/",
    "description": "The purpose of this organization is to create opportunities for students of any major areas of study by extending and expanding upon the interdisciplinary areas of study within and in relation to the department of Women & Gender Studies. This includes, but is not limited to, supporting students’ multimedia and community outreach projects as they relate to the classes they are actively enrolled in, primarily those within the Women and Gender Studies major breadth and the LGBTQ Studies Minor program, as well as establishing and maintaining a strong media presence to broadcast and promote education and conversations on the CSUS campus to discuss topics of interest and relevance to our department. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 4,
    "categories": [
      "Academic",
      "Arts & Media",
      "Cultural/Identity",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Computer Science",
      "Education",
      "Media / Journalism / Communications"
    ],
    "id": 330
  },
  {
    "name": "Women's Basketball Club",
    "clubUrl": "https://csus.campusgroups.com/ladyeagleswbb/",
    "description": "The Sacramento Native Athletics women’s basketball program (SNA) aims to provide a space for student athletes @ CSUS to compete for championships, pursue athletic and academic excellence, and ultimately connect with their peers or own identity as Native American, and understand what it means to be Native in today's society. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": null,
    "categories": [
      "Academic",
      "Cultural/Identity",
      "Professional",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Computer Science"
    ],
    "id": 331
  },
  {
    "name": "Women's Resource Center",
    "clubUrl": "https://www.csus.edu/student-affairs/centers-programs/women-resource-center/",
    "description": "Membership Benefits The Women’s Resource Center at Sac State is a welcoming and empowering space for women-identified students to connect, grow, and thrive. By joining our community, you’ll find a supportive environment where you can openly explore topics like identity, self-worth, relationships, and body image without judgment. We offer peer-led drop-in support groups, leadership opportunities, and engaging events focused on wellness, advocacy, and education. Whether you're seeking connection, personal growth, or a chance to be part of meaningful change on campus, the WRC is here to support you. Come as you are — there’s a place for you here.",
    "points": 10,
    "categories": [
      "Cultural/Identity",
      "Political/Advocacy",
      "Service/Volunteer"
    ],
    "fieldsOfStudy": [
      "Education",
      "Environmental / Sustainability"
    ],
    "id": 332
  },
  {
    "name": "Women's Rugby Club",
    "clubUrl": "https://csus.campusgroups.com/wrugby/",
    "description": "The Sacramento State Women's Rugby Sport Club strives to develop lifelong skills of collaboration, inclusion and unity through the sport of rugby. Our club was founded in Fall 1999 and has been a proud part of the Sacramento State Community ever since. We are a Division I Women's Collegiate team in the Pacific Mountain Rugby Conference. No experience is needed to join the club, the coaches and the members will help learn and develop skills and knowledge of the sport. All students, regardless of sex, race, color, or national origin, who are interested in the club’s mission are welcome.",
    "points": 2,
    "categories": [
      "Cultural/Identity",
      "Service/Volunteer",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [],
    "id": 333
  },
  {
    "name": "Women's Soccer Club",
    "clubUrl": "https://csus.campusgroups.com/wsoccer/",
    "description": "The purpose of this organization is to promote the growth of the game of soccer in a competitive aspect. It will provide students with the opportunity to improve their soccer skills in a comfortable and respectable environment, while competing against other universities.",
    "points": 25,
    "categories": [
      "Cultural/Identity",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Environmental / Sustainability"
    ],
    "id": 334
  },
  {
    "name": "Women's Volleyball Club",
    "clubUrl": "https://csus.campusgroups.com/wvball/",
    "description": "The Sacramento State Women's Volleyball Club focuses on building athleticism, motivation, encouragement, team skills, communication, competitiveness, and responsibility. The purpose of this organization is to give students the opportunity to play volleyball at the competitive level for the University against other collegiate volleyball clubs throughout California, as well as throughout the nation.",
    "points": 10,
    "categories": [
      "Cultural/Identity",
      "Sports/Recreation"
    ],
    "fieldsOfStudy": [
      "Media / Journalism / Communications"
    ],
    "id": 335
  },
  {
    "name": "Zeta Phi Beta Sorority, Inc.",
    "clubUrl": "https://csus.campusgroups.com/zetas/",
    "description": "We, a group of college women, do hereby bind ourselves together for the purpose of promoting the cause of education by encouraging the highest standard of scholarship through scientific, literary, cultural, and educational programs; promoting charitable projects on college campuses and within the community; fostering the spirit of sisterly love and promoting the ideal of Finer Womanhood.",
    "points": null,
    "categories": [
      "Arts & Media",
      "Cultural/Identity",
      "Service/Volunteer",
      "Social/Greek"
    ],
    "fieldsOfStudy": [
      "Education"
    ],
    "id": 336
  }
]